{
    "tmp_name": "tmp_sport_climbing_combined_olympics.json",
    "chosen_trend": {
        "name": "sport climbing combined olympics",
        "processed_news": [
            {
                "author": "Giovanni Canton, Nicholas Hobley",
                "base": "https://www.planetmountain.com",
                "provider": "planetmountain.com/en/news/competitions/paris-2024-olympics-live-sport-climbing-day-3-mens-lead-womens-speed-finals",
                "published_date": null,
                "text": "13:14\n\nPoland's Aleksandra Mirosław wins this first, historic Speed Climbing Olympic medal in the Paris 2024 Olympic Games. Silver goes to China's Lijuan Deng who was neck and neck with the Polish athlete right until the last moves. Polish teammate Aleksandra Kalucka secures bronze, while Rajiah Sallsabillah places fourth.\n\nWith the awarding of these first medals we'll now end our live reporting for today. We'll be back tomorrow at 10:00 with the Women's Lead Semifinal, followed by the Men's Speed Final at 12:35. We hope you enjoyed the spectacle, thanks for having been with us and see you tomorrow!\n\n12:59\n\nSPEED FINAL: Aleksandra Mirosław vs Lijuan Deng. Years of training for this moment. Deng gets off to an amazing start, but Miroslaw overtakes her, keeps it together, wins! Gold, the first historic Speed gold medal, goes to Aleksandra Mirosław.\n\n12:58\n\nSmall final: Aleksandra Kalucka vs Rajiah Sallsabillah. Kalucka sets off faster than lighting, Sallsabillah slips. Kalucka wins, tears of joy for her, bronze. The first Speed climbing ​medal is hers!\n\n\n\n12:54\n\nA short break, then the small final for bronze. In many respects this is the cruelest comp of all. Aleksandra Kalucka vs Rajiah Sallsabillah. The winner takes an Olympic medal....\n\n\n\n12:52\n\nSecond semifinal: Rajiah Sallsabillah vs Lijuan Deng. Tension is sky high. Deng wins, 6.38 vs 6.41. They hug each other. What a race!\n\n\n\n12:49\n\nFirst semifinal: Aleksandra Miroslaw vs Aleksandra Kalucka. Teammates, but this is no training run... Miroslaw wins, but only just. She's in the final! And she's guaranteed a medal!\n\n\n\n12:45\n\nDesak Made Rita Kusuma Dewi vs Lijuan Deng. Dewi starts well but Deng overtakes her right at the end. Speed climbing at its finest, 6 milleseconds separate the two.\n\n\n\n12:41\n\nEmma Hunt vs Rajiah Sallsabillah. Hunt storms ahead, then slips. Sallsabillah wins, 6:54\n\n\n\n12:39\n\nAleksandra Kalucka vs Yafei Zhou. Kalucka wins 6:49.\n\n\n\n12:36\n\nAleksandra Miroslaw vs. Leslie Adriana Romero Pérez. Miroslaw wins with ease.\n\n\n\n12:35\n\n15m high. 5° overhanging. 20 handholds. 11 footholds. 6.06 the world record. Those the stats. But the only thing that really counts is beating your opponent. The athletes are out, ready for the biggest competition of their lives!\n\n\n\n12:05\n\nAfter a short break, we'll be back at 12.30 for the women's speed. Their first-ever set of medals, awarded here in Paris in afew minutes time!\n\n\n\n11:58\n\nToday's Lead route was a tough test and despite the fact that no one managed to top out, the route setters did a great job of separating the athletes. The Semis proved exciting and the pressure was evidently intense. The top eight have qualified for the finals: Sorato Anraku (137), Toby Roberts (122.2), Adam Ondra (116.8), Alberto Gines Lopez (100.7), Jakob Schubert (98.8), Paul Jenft (91.1), Colin Duffy (87.9) and Hamish McArthur (79.3). They'll be back in the arena on Friday morning!\n\n\n\n1 1 JPN ANRAKU Sorato 69.0 (1) 68.0 (4) 137.0 Q 2 2 GBR ROBERTS Toby 54.1 (3) 68.1 (2) 122.2 Q 3 8 CZE ONDRA Adam 48.7 (5) 68.1 (2) 116.8 Q 4 13 ESP GINES LOPEZ Alberto 28.7 (14) 72.0 (1) 100.7 Q 5 3 AUT SCHUBERT Jakob 44.7 (6) 54.1 (6) 98.8 Q 6 12 FRA JENFT Paul 34.1 (9) 57.0 (5) 91.1 Q 7 6 USA DUFFY Colin 33.8 (11) 54.1 (6) 87.9 Q 8 18 GBR McARTHUR Hamish 34.2 (8) 45.1 (8) 79.3 Q 9 10 GER FLOHE Yannick 29.7 (12) 39.1 (9) 68.8 10 4 JPN NARASAKI Tomoa 54.4 (2) 12.1 (14) 66.5 11 9 FRA AVEZOU Sam 49.2 (4) 12.1 (14) 61.3 12 16 CHN PAN Yufei 29.0 (13) 30.1 (10) 59.1 13 7 GER MEGOS Alexander 24.7 (15) 24.0 (11) 48.7 14 15 BEL Van DUYSEN Hannes 34.3 (7) 12.0 (17) 46.3 15 5 KOR LEE Dohyun 34.0 (10) 12.0 (17) 46.0 16 17 SLO POTOCAR Luka 19.6 (17) 24.0 (11) 43.6 17 11 SUI LEHMANN Sascha 24.0 (16) 12.1 (14) 36.1 18 14 USA GRUPPER Jesse 18.9 (18) 12.0 (17) 30.9 19 19 AUS HARRISON Campbell 9.4 (19) 14.0 (13) 23.4 20 20 RSA JANSE van RENSBURG Mel 9.4 (19) 7.1 (20) 16.5\n\n11:52\n\nThere's no way Sorato Anraku can know it, but thanks to his excellent Boulder score the Japanese is mathematically in the final even before starting his lead run! The 19-year-old climbs confidently and quickly, without taking any risks whatsoever. He reaches the upper section but then, just like Ondra and Roberts, falls off the headwall moves that prove to intense and complex. Repeating his outstanding Boulder performance, he places first overall with a stunning 137 points.\n\n11:45\n\nToby Roberts is today's penultimate athlete and he's in strong contention for a medal! But the pressure and tension is the same for everyone. Right from the outset he climbs keeping everyone on tenterhooks, makes a couple of mistakes low down but miraculously stays glued to the wall. With his fingertips. After almost falling low down, he enters fight mode. Battles, recovers. Never gives up. And reaches the same hold as Adam Ondra before dropping off. 122.2 points, provisional first. And certainly in the final!\n\n11:34\n\nTomoa Narasaki, the first Japanese to compete today, knows he has to climb a bit outside his comfort zone if he wants a place in the finals. His risk-taking style isn't ideal for today's route and he ends his Olympics earlier than expected. His score of 66.5 won't be enough for the finals.\n\n\n\n11:30\n\nThe route is merciless, takes no prisoners. Even Dohyun Lee falls victim, low down, with a score of 46.0.\n\n\n\n11:25\n\nThe route continues to be unpredictable, nothing can be taken for granted, the athletes have shown us that it's possibile to fall literally anywhere. Colin Duffy tackles the route head-on, guns blazing, leaving nothing to chance. Halfway up he fumbles a clip. He continues, then falls. 87.9 his final score. Will it be enough to secure a ticket for the final? There are still 5 to go...\n\n11:20\n\nAlex Megos must now redeem himself after his poor performance in Boulder. He has a mountain ahead of him. He climbs confidently through the first section but suddenly his foot slips! Incredible! Unfortunately his race for an Olympic medal ends here, with a disappointingly low score of 48.7.\n\n11:14\n\nHere's an athlete we've all been waiting for, Adam Ondra, 3 times Lead World Champion, one one boulder, bronze at the Tokyo Olympics. He's gunning for gold. Banking on his incredible experience he seems to rest on every single hold, jams, takes weight off his hands. Completely soldi through the footless section, he's confident but not complacent. Now he's on the headwall, close to the highpoint set by Lopez, but then he fails to find the right body position and falls. Ondra being Ondra, he's not fully satisfied with his performance. But he also knows he's done enough to qualify for the final. He smiles and finishes the comp with 116.8 points, provisional first.\n\n\n\n11:09\n\nThe crowd goes into overdrive, Sam Avezou is out next! And the 7000 spectators continue to cheer him throughout the test! He climbs quickly, but perhaps a little too quickly, taking many risks. Too many? His foot slips and he falls, in absolute disbelief! He waves goodbye to the crowd, almost apologetically, with 61.3 points\n\n11:06\n\nYannick Flohé tackles the route in control, climbing quickly and without problems low down. All of a sudden though he's in trouble. Completely. He falls and concludes his run with 68.7 points, too few for his Olympic dream!\n\n\n\n11:02\n\nSascha Lehmann out now, in his favourite discipline. However, he's not as cool and calm as usual, isn't efficient and falls low. Surprisingly, he finishes the comp with just 36.1 total points. His Olympic adventure ends here.\n\n10:56\n\nThe crowd erupts, cheers and chants to welcome Paul Jenft! The Frenchman climbs well, somehow finding excellent positions to rest in the overhanging section despite his unbelievable height of 1.90m. But too many risks on the traverse prove costly. He finishes the comp with 91.1 points though and is provisional second.\n\n10:50\n\nAfter an hour of competition, reigning Olympic Champion Alberto Ginés López, enters the stadium, wanting to redeem himself from a somewhat underpar boulder performance. He climbs far more relaxed than the rest of the field, perhaps feeding off his Tokyo experience. He's quick where he needs to be, takes a few calulated risks though the overhang, and suddenly is far higher than everyone else. Way higher. The route setters must be relieved. Then he falls on the headwall. 100.7 points in total put him into provisional first in the overall results. It is too early to say, but we'll hazard a guess: he's probably done enough for the final.\n\n\n\n10:45\n\nThe route is proving to be a extremely tough test for the athletes who have to fight pretty much right from the outset. Add to this the tension of being at the Olympics. But the top ten still need to climb. We can't wait to see what they'll get up to...\n\n\n\n10:42\n\nJesse Grupper begins by greeting the crowds with a huge smile! He climbs through the first part with determination but without haste. Up on the volumes he's suddenly in difficulty and falls low, way to low for his liking.\n\n\n\n10:38\n\nHannes Van Duysen sets off like a rocket he doesn't want to stay on the holds for a second longer than necessary. But halfway through the overhang he takes too much of a risk and falls. Way too low. He could have done much, much more.\n\n\n\n10:34\n\nPan Yufei enters the arena. He climbs a bit slowly, isn't as precise as usual, seems to struggle. The tension of the Olympic competition must be sky high. He falls and will no doubt be disappointed with his score of 30.1. Nevertheless he's in provisional third behind MacArthur. And Sorato Anraku, who hasn't climbed yet.\n\n\n\n10:30\n\nLuka Potocar is now out, ready to make up for a poor show in bouldering. Winner of the Lead World Cups, expectations are understandably high here. But he makes a few too many mistakes low down, he hesitates and falls low. He almost overly relaxed, definitely not his best showing today. 24 points.\n\n10:24\n\nThird athlete out is Hamish McArthur. The Brit seems slightly nervous but nevertheless climbs impressively. He controls the moves through the overhanging section leaving nothing to chance, but on the upper sections he wastes precious energy clipping a quickdraw. Despite this he goes full throttle and a few moves without feet he falls. 45.1 points. A great climb, probably not enough though.\n\n\n\n10:17\n\nNext up Campbell Harrison route in his favorite discipline. He'll certainly want to redeem himself after Monday's disappointing performance in Boulder. He climbs with determination and rhythm through the first section, comfortably through the traverse, but falls on the first volumes. What a great climb for the Australian who's done so much for climbing in general! 14 points.\n\n10:15\n\nThis Olympic semi-final begins with Mel Janse van Rensburg. He climbs through the first without hesitation, but as soon as he enters the steepest section the route changes gear and the South African tumbles. 7.1 his score.\n\n\n\n10:07\n\nAthletes are back in isolation. Mel Janse Van Rensburg will be the first out. The stadium is packed and ready to go!\n\n\n\n10:01\n\nThe comp has officially begun. 20 athletes are below the wall observing the route. They've got 5 minutes to check out the beta and it's great seeing that working out the moves together. Sportsmanship at its best. Better still, the Olympic spirit at its best!\n\n\n\n9:55\n\nAfter the sweltering heat on Monday and Tuesday, Wednesday is slightly cloudy. Temperatures should be lower, 17°C at the moment, but the action will be as blazingly hot!\n\n\n\n9:50\n\nLead is about to begin. Just a quick reminder about the Olympic scoring system which is significantly differentl from World Cup events. There are four scoring sections on the wall, and the higher they climb the more points they are awarded. Scores are assigned to each hold in descending order, starting from the top: the 10 highest holds, including the top, are worth four points each, followed by 10 holds that are worth three points each, 10 that are worth two points each, and 10 that are worth one point each. Any remaining hold before the start of the route has no point value. There will be signage on the wall to tell you the sections. An additional 0.1 points is awarded for using, but not controlling a hold.\n\n\n\n7:36\n\nWednesday 7 August, day 3 of sport climbing at the Paris 2024 Olympic Games. Today the first, historic Speed ​medals will be awarded. Yes because while at the Tokyo Olympics only 1 medal per gender was awarded to the Combined discipline that comprised Speed, Boulder & Lead, here in Paris the number of medals has been increased to 2 per gender: one for the Speed and one for the Combined Boulder+Lead.\n\nSo today all eyes will be on Speed starting at 12:30, in particular on immortal Aleksandra Mirosław who two days ago set a new world record by stopping the clock after 6.06 seconds. But first up there's the men's Lead, on that beautiful wall on the left side of the arena. 100 points are on the table and will be added to those already earned in Boulder two days ago. The best 8 qualify for the final. Sorato Anraku currently sits firmly in first place with 69 points, ahead of Tomoa Narasaki with 54.4 points and Toby Roberts with 54.1 points.\n\nJoin planetmountain for the latest sport climbing news from the Paris 2024 Olympic Games. Our reporting will begin shortly before 10:00. The athletes competing today are:\n\nMEN'S BOULDER & LEAD\n\nJakob Schubert (AUT) - 1. World Championships Bern 2023\n\nColin Duffy (USA) - 2. World Championships Bern 2023\n\nTomoa Narasaki (JPN) - 3. World Championships Bern 2023\n\nToby Roberts (GBR) - 1. European Qualifier Laval 2023\n\nJesse Grupper (USA) - 1. Pan American Games Santiago 2023\n\nSorato Anraku (JPN) - 1. Asian Qualifier Jakarta 2023\n\nCampbell Harrison (AUS) - 1. Oceania Qualifier Melbourne 2023\n\nMel Janse Van Rensburg (RSA) - 1. African Qualifier Pretoria 2023\n\nDohyun Lee (KOR) - 1. Olympic Qualifier Series\n\nSam Avezou (FRA) - 2. Olympic Qualifier Series\n\nAdam Ondra (CZE) - 3. Olympic Qualifier Series\n\nAlberto Ginés López (ESP) - 4. Olympic Qualifier Series\n\nHannes Van Duysen (BEL) - 5. Olympic Qualifier Series\n\nPaul Jenft (FRA) - 6. Olympic Qualifier Series\n\nYannick Flohé (GER) - 8. Olympic Qualifier Series\n\nHamish Mcarthur (GBR) - 9. Olympic Qualifier Series\n\nSascha Lehmann (SUI) - 10. Olympic Qualifier Series\n\nAlexander Megos (GER) - 11. Olympic Qualifier Series\n\nLuka Potocar (SLO) - 12. Olympic Qualifier Series\n\nPan Yufei (CHN) - 13. Olympic Qualifier Series\n\nWOMEN'S SPEED\n\nDesak Made Rita Kusuma Dewi (INA) - 1. World Championships Bern 2023\n\nEmma Hunt (USA) - 2. World Championships Bern 2023\n\nAleksandra Miroslaw (POL) - 1. European Qualifier Rome 2023\n\nPiper Kelly (USA) - 1. Pan American Games Santiago 2023\n\nLijuan Deng (CHN) - 1. Asian Qualifier Jakarta 2023\n\nSarah Tetzlaff (NZL) - 1. Oceania Qualifier Melbourne 2023\n\nAniya Holder (RSA) - African Qualifier Pretoria 2023\n\nYafei Zhou (CHN) - 1. Olympic Qualifier Series\n\nAleksandra Kalucka (POL) - 2. Olympic Qualifier Series\n\nRajiah Sallsabillah (INA) - 3. Olympic Qualifier Series\n\nCapucine Viglione (FRA) - 7. Olympic Qualifier Series\n\nManon Lebon (FRA) - 10. Olympic Qualifier Series\n\nLeslie Adriana Romero Pérez (ESP) - 12. Olympic Qualifier Series\n\nBeatrice Colli (ITA) - 13. Olympic Qualifier Series",
                "title": "Aleksandra Mirosław wins Speed Climbing's historic first gold at Paris 2024!",
                "top_image": "https://www.planetmountain.com/utils/images.php?file=130155&size=2",
                "url": "https://www.planetmountain.com/en/news/competitions/paris-2024-olympics-live-sport-climbing-day-3-mens-lead-womens-speed-finals.html",
                "keywords": [
                    "qualifier",
                    "historic",
                    "points",
                    "vs",
                    "climbs",
                    "paris",
                    "aleksandra",
                    "olympic",
                    "hes",
                    "route",
                    "speed",
                    "world",
                    "low",
                    "gold",
                    "wins",
                    "climbings",
                    "mirosław",
                    "2024",
                    "falls"
                ],
                "summary": "13:14Poland's Aleksandra Mirosław wins this first, historic Speed Climbing Olympic medal in the Paris 2024 Olympic Games.\nGold, the first historic Speed gold medal, goes to Aleksandra Mirosław.\nBut he makes a few too many mistakes low down, he hesitates and falls low.\nOlympic Qualifier SeriesWOMEN'S SPEEDDesak Made Rita Kusuma Dewi (INA) - 1.\nOlympic Qualifier Series"
            },
            {
                "author": "",
                "base": "https://olympics.com",
                "provider": null,
                "published_date": null,
                "text": "Track cycling: Australia win men's team pursuit gold\n\nIt's time for the men's team pursuit final. Australia haven't won this title since Athens 2004. Great Britain won this title in 2008, 2012, and 2016.\n\nThe Aussies broke the world record yesterday. Can they repeat that today?\n\nIt's a fast start from both teams who trade narrow leads through the first kilometre of four. It is neck and neck. Just 0.007 seconds split the teams at 1km.\n\nAustralia slowly but surely start to pull away around 2km in as the gap grows to a tenth, then two tenths.\n\nBoth teams drop to three men with 1.5km to go and the gap is two tenths of a second. Remember, the third man across the line is when the time stops.\n\nInto the last kilometre as Britain's trio close the gap under two tenths.\n\nThis is going to be close! The bell lap with 0.168 seconds separate the two teams – oh no!\n\nGreat Britain nearly crash in the dying metres but Ethan Hayter just about hangs on to it!\n\nAustralia take gold in 3:42.067. Great Britain claim silver and Italy bronze.\n\nA 20-year wait for gold is over.",
                "title": "Sport climbing round-up as Olympic and world records smashed",
                "top_image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/gtwy2irg1rwkghw1ds4e",
                "url": "https://olympics.com/en/paris-2024/live-updates/913d8ab6-88da-414c-901d-3f09504ddf27",
                "keywords": [
                    "pursuit",
                    "team",
                    "roundup",
                    "world",
                    "neck",
                    "start",
                    "seconds",
                    "smashed",
                    "olympic",
                    "climbing",
                    "gap",
                    "title",
                    "records",
                    "britain",
                    "teams",
                    "sport",
                    "won"
                ],
                "summary": "Track cycling: Australia win men's team pursuit goldIt's time for the men's team pursuit final.\nGreat Britain won this title in 2008, 2012, and 2016.\nIt's a fast start from both teams who trade narrow leads through the first kilometre of four.\nIt is neck and neck.\nAustralia slowly but surely start to pull away around 2km in as the gap grows to a tenth, then two tenths."
            },
            {
                "author": "",
                "base": "https://www.jagranjosh.com",
                "provider": null,
                "published_date": "2024-08-07T11:46:20+00:00",
                "text": "Google's iconic doodles have a knack for capturing the essence of global events, and the 2024 Paris Olympics is no exception. On August 7, 2024, the search giant unveiled a dynamic animation celebrating the exhilarating sport of climbing, which is a key event at the Olympic Games. The doodle depicts a fleet of birds scaling a Parisian building, their tiny claws gripping the stone with remarkable agility. This playful yet powerful illustration perfectly encapsulated the spirit of the climbers as they conquered new heights.\n\nClimbing's Olympic Journey\n\nMaking its debut as an Olympic sport at the Tokyo 2021 Games, climbing rapidly gained a global following. The Paris Olympics further elevated its status, with a larger contingent of 68 athletes from around the world competing for medals.\n\nThe inclusion of Sports Climbing in the Tokyo 2021 Olympics was a historic moment for the sport, bringing it to a global audience and inspiring a new generation of climbers. The Paris 2024 Olympics will build on this success, with refinements to the format and increased visibility for the athletes.\n\nOne significant change for Paris 2024 is the separation of Speed Climbing into its own medal event, while Bouldering and Lead Climbing will be combined into a single competition. This adjustment allows climbers to specialize and focus on their strengths, promising even more intense and exciting competitions.\n\nThe Olympics website mentions: “The world’s best 68 men’s and women’s sport climbing athletes will compete at the Olympic Games Paris 2024, from 5-10 August. This growing sport will now feature twice as many medal opportunities as Tokyo 2020, where sport climbing debuted on the Olympic programme. The two medal events now include speed, and bouldering and lead combined. Forty athletes will compete in boulder and lead, with 28 men and women competing in speed.”",
                "title": "Paris Olympics 2024: Google Doodle Celebrates Sports Climbing Combined",
                "top_image": "https://img.jagranjosh.com/images/2024/August/782024/sports-climbing.jpg",
                "url": "https://www.jagranjosh.com/general-knowledge/google-doodle-celebrates-sports-climbing-combined-1723031462-1",
                "keywords": [
                    "speed",
                    "celebrates",
                    "tokyo",
                    "medal",
                    "lead",
                    "google",
                    "climbing",
                    "combined",
                    "olympic",
                    "paris",
                    "olympics",
                    "doodle",
                    "2024",
                    "sport"
                ],
                "summary": "Google's iconic doodles have a knack for capturing the essence of global events, and the 2024 Paris Olympics is no exception.\nThe Paris Olympics further elevated its status, with a larger contingent of 68 athletes from around the world competing for medals.\nThe Paris 2024 Olympics will build on this success, with refinements to the format and increased visibility for the athletes.\nOne significant change for Paris 2024 is the separation of Speed Climbing into its own medal event, while Bouldering and Lead Climbing will be combined into a single competition.\nThe Olympics website mentions: “The world’s best 68 men’s and women’s sport climbing athletes will compete at the Olympic Games Paris 2024, from 5-10 August."
            },
            {
                "author": "",
                "base": "https://www.lacrux.com",
                "provider": null,
                "published_date": "2024-08-07T03:00:00+00:00",
                "text": "Today, August 7, 2024, the men's semifinals in lead climbing and the women's quarterfinals, semifinals and finals in speed are taking place in the combined format at the Olympic Games in Paris. Here you can find the live streams so you can follow today's competition day at the Olympic Games in Paris. We will then summarize the events for you in a separate article.\n\nThe news about the 2024 Olympic Games in Paris is presented by Mammut and Unparallel\n\nProgram Semifinal Lead Men and Quarter-, Semifinal and Final Speed ​​Women | Sport Climbing Olympics\n\n10.00 – 12.05: Bouldering & Lead, semi-final Lead Men\n\n12.35 – 12.43: Speed, quarter-final women\n\n12.46 – 12.50: Speed, women’s semi-final\n\n12.54 – 12.59: Speed, Final Women\n\nMammut Massone Pants:\n\nGreat climbing pants The Massone Pants offer robust fabric and freedom of movement for all climbing adventures. With five pockets, including a thigh pocket with zipper that can also be accessed in a climbing harness. The drawstrings can be worn inside or outside thanks to eyelets. Made from a viscose-polyester mix, they are as comfortable as cotton and as stretchy as elastane. Allez!\n\nLivestreams Sport Climbing Olympics\n\nFor persons outside Switzerland and Germany it is possible to use the following Live streams via VPN watch.\n\nSRF Livestream Semifinal Lead Men\n\nImage SRF\n\nZDF Livestream Semifinal Lead Men\n\nImage ZDF\n\nUnparallel Flagship Pro:\n\nHigh-performance competition climbing shoe The Flagship Pro is a competition shoe that was developed together with Boulder World Champion Tomoa Narasaki. The 2-part sole design made of RS and RH rubber enables maximum stiffness, stability and power transfer to the toes. The aggressive downturn of the sole ensures maximum performance in overhanging sport climbing routes and bouldering problems.\n\nSRF Livestream Quarter-, Semi-Final and Final Speed ​​Women\n\nImage SRF\n\nZDF Livestream Quarter-, Semi-Final and Final Speed ​​Women\n\nImage ZDF\n\nContent partner Olympic Games 2024 in Paris\n\nThe coverage of the 2024 Olympic Games in Paris is presented by Mammut and Unparallel:\n\nMammoth is a Swiss outdoor company founded in 1862 that offers mountain sports fans all over the world high-quality products and unique brand experiences. For 160 years, the world's leading premium brand has stood for safety and groundbreaking innovation. Mammut products combine functionality and performance with contemporary design. With the combination of hardware, shoes and clothing, Mammut is one of the most complete providers in the outdoor market. Mammut Sports Group AG operates in around 40 countries and employs around 850 people.\n\nMaximum grip, sophisticated designs and «hand-made in California»: The brand unparallel not only impresses with years of experience in the production of climbing shoes, but also relies on a sustainable philosophy - as well as on a selection of specially developed rubber compounds that are processed exclusively by long-standing, local partners.\n\nThat might interest you\n\nDo you like our climbing magazine? When launching the climbing magazine Lacrux, we decided not to introduce a paywall because we want to provide as many like-minded people as possible with news from the climbing scene.\n\n\n\nIn order to be more independent of advertising revenue in the future and to provide you with even more and better content, we need your support.\n\n\n\nTherefore: Help and support our magazine with a small contribution. Naturally you benefit multiple times. How? You will find out here.\n\n+ + +\n\nCredits: Cover image Drapella/Virt/IFSC",
                "title": "Livestream and program: Olympic semifinal lead | Men",
                "top_image": "https://www.lacrux.com/wp-content/uploads/2024/08/Livestream-und-Programm-Olympia-Halbfinal-Lead-Herren.webp",
                "url": "https://www.lacrux.com/en/sport-climbing-olympics-paris-2024/livestream-and-program-olympia-semifinal-lead-men/",
                "keywords": [
                    "speed",
                    "program",
                    "lead",
                    "livestream",
                    "men",
                    "semifinal",
                    "olympic",
                    "climbing",
                    "paris",
                    "final",
                    "mammut",
                    "games"
                ],
                "summary": "Today, August 7, 2024, the men's semifinals in lead climbing and the women's quarterfinals, semifinals and finals in speed are taking place in the combined format at the Olympic Games in Paris.\nHere you can find the live streams so you can follow today's competition day at the Olympic Games in Paris.\nThe news about the 2024 Olympic Games in Paris is presented by Mammut and UnparallelProgram Semifinal Lead Men and Quarter-, Semifinal and Final Speed ​​Women | Sport Climbing Olympics10.00 – 12.05: Bouldering & Lead, semi-final Lead Men12.35 – 12.43: Speed, quarter-final women12.46 – 12.50: Speed, women’s semi-final12.54 – 12.59: Speed, Final WomenMammut Massone Pants:Great climbing pants The Massone Pants offer robust fabric and freedom of movement for all climbing adventures.\nSRF Livestream Semifinal Lead MenImage SRFZDF Livestream Semifinal Lead MenImage ZDFUnparallel Flagship Pro:High-performance competition climbing shoe The Flagship Pro is a competition shoe that was developed together with Boulder World Champion Tomoa Narasaki.\nSRF Livestream Quarter-, Semi-Final and Final Speed ​​WomenImage SRFZDF Livestream Quarter-, Semi-Final and Final Speed ​​WomenImage ZDFContent partner Olympic Games 2024 in ParisThe coverage of the 2024 Olympic Games in Paris is presented by Mammut and Unparallel:Mammoth is a Swiss outdoor company founded in 1862 that offers mountain sports fans all over the world high-quality products and unique brand experiences."
            },
            {
                "author": "Mary Whitfill Roeloffs, Michelle Bruton, Antonio Pequeño Iv, Conor Murray, Forbes Staff",
                "base": "https://www.forbes.com",
                "provider": null,
                "published_date": "2024-08-05T22:00:00+00:00",
                "text": "Topline\n\nAmerican teenager Sam Watson set a new world record at the Olympics on Tuesday in the relatively new Olympic event of sport climbing for speed, which sets two climbers against each other as they race side-by-side to be the first to make their way up a 15-meter wall.\n\nSam Watson of Team United States competes during the men's speed qualifiers at the Olympic Games in ... [+] Paris on Aug. 6, 2024. Getty Images\n\nKey Facts\n\nThe speed discipline pulls out a single unique skill from the overarching event of sport climbing, which debuted at the Olympics in Tokyo. At the games in 2021, sport climbing was run as a single event that combined the three specialities of bouldering (climbing performed on short, technical routes without a rope), lead climbing (in which the climber clips a rope to protection points along the way) and speed (in which little other technicalities matter, other than quickness). For the Paris games, sport climbing was split into two separate opportunities to medal: in a combined event of bouldering and lead climbing, and in speed climbing. Speed climbers compete one-on-one to reach the top of a 15-meter wall as quickly as possible and the slower climbers are eliminated round by round in a bracket-style competition until one winner remains. Splitting the event into separate disciplines in Paris eased some criticism of the way sport climbing was run in Tokyo, where athletes said the various skills represent completely different specialities and feats of athleticism, and that forcing climbers to compete in a combined event resulted in an unfair “circus” that did little to showcase technical prowess.\n\nGet Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign up here.\n\nCrucial Quote\n\n“The two events are completely different, and fans will notice that just by looking at the climber's body type,” French climber Oriane Bertone, who specializes in bouldering and lead climbing, told the Paris 2024 committee. “They have very different styles.”\n\nNews Peg\n\nWatson, 18, of Texas, set a speed world record of 4.75 seconds in qualifying rounds of sport climbing at the Olympics on Tuesday. He beat his own record of 4.79 seconds, which he set at a World Cup event in China earlier this year (it was matched by Veddriq Leonardo of Indonesia on Tuesday before Watson broke it). Watson next faces New Zealand’s Julian David in the quarterfinals of the men’s speed event Thursday.\n\nSurprising Fact\n\nWith the new world record, Watson also has the title of the fastest time ever in a timed Olympic sport, according to CNN.\n\nWhat To Watch For\n\nThe final in women's speed sport climbing will be held at 6:54 a.m. EDT time Wednesday. The men's finals will be held at the same time Thursday.\n\nFurther Reading\n\nCNN American teenager Sam Watson sets world record in speed climbing, the fastest sport at the Paris Olympics | CNN\n\nForbes Here's What To Expect From 2024 Olympic Climbing\n\nForbes Imane Khelif Prepares For Semifinal Bout Amid Boxing Gender Test Controversy",
                "title": "What Is Sport Climbing? American Breaks Record In Controversial (And Relatively New) Olympic Event",
                "top_image": "https://imageio.forbes.com/specials-images/imageserve/66b278cc725aa52d531d270d/0x0.jpg?format=jpg&crop=3837,2159,x0,y0,safe&height=900&width=1600&fit=bounds",
                "url": "https://www.forbes.com/sites/maryroeloffs/2024/08/06/what-is-sport-climbing-american-breaks-record-in-controversial-and-relatively-new-olympic-event/",
                "keywords": [
                    "speed",
                    "relatively",
                    "american",
                    "world",
                    "event",
                    "olympic",
                    "climbing",
                    "breaks",
                    "watson",
                    "paris",
                    "climbers",
                    "olympics",
                    "sport",
                    "record",
                    "controversial"
                ],
                "summary": "Getty ImagesKey FactsThe speed discipline pulls out a single unique skill from the overarching event of sport climbing, which debuted at the Olympics in Tokyo.\nFor the Paris games, sport climbing was split into two separate opportunities to medal: in a combined event of bouldering and lead climbing, and in speed climbing.\n“They have very different styles.”News PegWatson, 18, of Texas, set a speed world record of 4.75 seconds in qualifying rounds of sport climbing at the Olympics on Tuesday.\nSurprising FactWith the new world record, Watson also has the title of the fastest time ever in a timed Olympic sport, according to CNN.\nWhat To Watch ForThe final in women's speed sport climbing will be held at 6:54 a.m. EDT time Wednesday."
            },
            {
                "author": "",
                "base": "https://english.news.cn",
                "provider": "english.news.cn/20240808/2def128edda24f34b3cc859200d99149/c",
                "published_date": "2024-08-07T22:00:00+00:00",
                "text": "Aleksandra Miroslaw (L) of Poland and Deng Lijuan of China compete in the women's sport climbing speed final at the Paris 2024 Olympic Games in Le Bourget, France, on Aug. 7, 2024. (Xinhua/Gao Jing)\n\nAleksandra Miroslaw of Poland clinched the first-ever Olympic gold in women's speed climbing at Paris 2024, narrowly defeating China's Deng Lijuan and setting a new world record.\n\nPARIS, Aug. 7 (Xinhua) -- Aleksandra Miroslaw of Poland bested China's Deng Lijuan in the big final to win sport climbing women's speed gold in this event's Olympic debut at Paris 2024 here on Wednesday.\n\nThe two-time world champion, fresh from setting a new world record of 6.06 seconds on Monday, clocked 6.10 to beat Zhou's personal best of 6.18.\n\n\"It means a lot. It's like the first time for the speed climbing and also for me here in the discipline, and I have my flag, and I was standing on the podium on the first place hearing the national anthem. It was amazing,\" said Miroslaw, who narrowly missed the podium in women's combined at the Tokyo Olympics three years ago when the sport was first introduced to the Olympic program.\n\nAsked how far she could go, the Pole replied with \"I don't know\". \"The sky is the limit I would say,\" she added.\n\nGold medalist Aleksandra Miroslaw of Poland poses with new work record, Aug. 7, 2024. (Xinhua/Gao Jing)\n\nDeng's silver is the first Olympic sport climbing medal for China, but she didn't appear to be overwhelmed by emotions.\n\n\"I think I haven't realized yet what I have achieved. I am bit at loss at the moment,\" said the 24-year-old. \"I think I'm a calm person, which is good for the sport.\"\n\nDeng said she was in a soundless world of her own despite the roaring crowds before the competitions.\n\nDeng edged reigning world champion Desak Made Rita Kusuma Dewi of Indonesia by a slim 0.006 seconds in the quarterfinals in the closest duel of the day, and had a solid performance to prevail in the semifinal clash against another Indonesian climber Rajiah Sallsabillah.\n\n\"I didn't think too much. I just focused on doing my best and concentrated on each climb without thinking about other things,\" said Deng.\n\nGold medalist Aleksandra Miroslaw (C) of Poland, silver medalist Deng Lijuan (L) of China and bronze medalist Aleksandra Kalucka of Poland communicate during the award ceremony, on Aug. 7, 2024. (Xinhua/Gao Jing)\n\nAnother Pole Aleksandra Kalucka (6.53) defeated Sallsabillah (8.24) in the small final to win the bronze.\n\n\"I was so happy and I couldn't believe that I just won (the) bronze medal. I'm super happy and proud of myself that I did it,\" said Kalucka.\n\nThe 22-year-old revealed that she texted her twin sister Natalie first after the match to share her joys. Natalie is also among the world's top sport climbers but missed the Olympics as each National Olympic Committee has only two quota places in the event.\n\n\"My sister is the most important person in my life. She gives me (everything) every day and I can truly say (that) without her, I wouldn't be here,\" she said.\n\nIn the lead competition of men's combined earlier on Wednesday, Alberto Gines Lopez of Spain led the field with 72 points and advanced into the Friday's final in the fourth place overall, while Sorato Anraku of Japan, fourth place in lead with 68 points, entered the final as top finisher overall. ■",
                "title": "Olympics | Poland's Miroslaw wins inaugural sport climbing women's speed gold at Paris Olympics",
                "top_image": "",
                "url": "https://english.news.cn/20240808/2def128edda24f34b3cc859200d99149/c.html",
                "keywords": [
                    "wins",
                    "speed",
                    "womens",
                    "world",
                    "poland",
                    "inaugural",
                    "aleksandra",
                    "olympic",
                    "climbing",
                    "paris",
                    "final",
                    "olympics",
                    "miroslaw",
                    "2024",
                    "gold",
                    "sport",
                    "polands"
                ],
                "summary": "Aleksandra Miroslaw (L) of Poland and Deng Lijuan of China compete in the women's sport climbing speed final at the Paris 2024 Olympic Games in Le Bourget, France, on Aug. 7, 2024.\n(Xinhua/Gao Jing)Aleksandra Miroslaw of Poland clinched the first-ever Olympic gold in women's speed climbing at Paris 2024, narrowly defeating China's Deng Lijuan and setting a new world record.\nPARIS, Aug. 7 (Xinhua) -- Aleksandra Miroslaw of Poland bested China's Deng Lijuan in the big final to win sport climbing women's speed gold in this event's Olympic debut at Paris 2024 here on Wednesday.\nGold medalist Aleksandra Miroslaw of Poland poses with new work record, Aug. 7, 2024.\n(Xinhua/Gao Jing)Deng's silver is the first Olympic sport climbing medal for China, but she didn't appear to be overwhelmed by emotions."
            },
            {
                "author": "Fe Online",
                "base": "https://www.financialexpress.com",
                "provider": null,
                "published_date": null,
                "text": "Google Doodle unveiled an illustration today to celebrate the ‘Climbing event’ at the Paris Olympics 2024. This doodle will be visible globally.\n\nSport Climbing Paris Olympics 2024: The description reads, “Hold off on those other plans because this main event is gripping! Victory is just within reach for the Climbing contestants!” The illustration features a bird climbing a statue, symbolising the scheduled Semifinal Lead ‘Climbing event’ at the Paris Olympics 2024 today.\n\nGoogle released this doodle to mark the ‘Semifinal Lead’ of the climbing sports event happening today. In the Men’s Boulder and Lead event, participants include Janse van Rensburg from South Africa, C Harrison from Australia, H McArthur from Great Britain, L Ptocar from Slovenia, Y F Pan from China, and many others. The event will be live-streamed on Jio Cinema and Network 18 channels at 1:30 pm.\n\nAlso Read Vinesh Phogat faints, hospitalised in Paris due to dehydration Vinesh Phogat disqualified: Phogat found overweight in 50kg category, misses on gold medal Vinesh Phogat disqualified from Paris 2024 Olympics: Why and what this means? Paris Olympics 2024: All about Yusuf Dikec – The ‘hitman’ who has taken the internet by storm\n\nHere are India’s sporting events scheduled for today (Day 12, Wednesday):\n\nAthletics:\n\n– Mixed Marathon Walk Relay (Medal round): Priyanka Goswami and Suraj Panwar – 11:00 am\n\n– Men’s High Jump (Qualification): Sarvesh Kushare – 1:35 pm\n\n– Women’s 100m Hurdles (Round 1): Jyothi Yarraji (Heat 4) – 1:45 pm\n\n– Women’s Javelin Throw (Qualification): Annu Rani – 1:55 pm\n\n– Men’s Triple Jump (Qualification): Praveen Chithravel and Abdulla Aboobacker Narangolintevida – 10:45 pm\n\n– Men’s 3,000m Steeplechase (Final): Avinash Sable – 1:13 am (August 8, Thursday)\n\nGolf:\n\n– Women’s Individual (Round 1): Aditi Ashok and Diksha Dagar – 12:30 pm\n\nTable Tennis:\n\n– Women’s Team (Quarter-final): India (Sreeja Akula, Manika Batra, and Archana Girish Kamath) vs Germany – 1:30 pm\n\nWrestling:\n\n– Women’s Freestyle 53kg (1/8 Finals): Antim Panghal vs Zyenep Yetgil – 3:05 pm",
                "title": "Sport Climbing Combined: Google Doodle celebrates climbing event at Paris Olympics 2024",
                "top_image": "https://www.financialexpress.com/wp-content/uploads/2024/08/Google_153cb8.jpg",
                "url": "https://www.financialexpress.com/sports/sport-climbing-combined-google-doodle-celebrates-climbing-event-at-paris-olympics-2024/3576249/",
                "keywords": [
                    "celebrates",
                    "womens",
                    "phogat",
                    "google",
                    "mens",
                    "event",
                    "climbing",
                    "combined",
                    "paris",
                    "vinesh",
                    "olympics",
                    "doodle",
                    "2024",
                    "sport",
                    "today"
                ],
                "summary": "Google Doodle unveiled an illustration today to celebrate the ‘Climbing event’ at the Paris Olympics 2024.\nSport Climbing Paris Olympics 2024: The description reads, “Hold off on those other plans because this main event is gripping!\nVictory is just within reach for the Climbing contestants!” The illustration features a bird climbing a statue, symbolising the scheduled Semifinal Lead ‘Climbing event’ at the Paris Olympics 2024 today.\nGoogle released this doodle to mark the ‘Semifinal Lead’ of the climbing sports event happening today.\nAlso Read Vinesh Phogat faints, hospitalised in Paris due to dehydration Vinesh Phogat disqualified: Phogat found overweight in 50kg category, misses on gold medal Vinesh Phogat disqualified from Paris 2024 Olympics: Why and what this means?"
            },
            {
                "author": "Paul Myers",
                "base": "https://www.rfi.fr",
                "provider": null,
                "published_date": "2024-08-06T22:00:00+00:00",
                "text": "Paris Olympics 2024\n\n\"Will it be a surprise or will it be the favourite?\" intoned the master of ceremonies early on Wednesday afternoon at the Le Bourget Climbing Venue as top seed Aleksandra Miroslaw was limbering up on Wall A adjacent to the anointed outsider Lijuan Deng on Wall B.\n\nPoland's Aleksandra Miroslaw celebrates after winning in the women's sport climbing speed final during the Paris 2024 Olympic Games at Le Bourget Sport Climbing Venue in Le Bourget on 7 August, 2024.\n\nAdvertising Read more\n\nA matter of moments later, the 8,000 spectators gathered around the combat zone had their answer.\n\nMiroslaw had surged up the array of holds pinned into the 15-metre wall on a 5 percent incline in 6.10 seconds to claim the first Olympic speed title in women's sports climbing.\n\nDeng, the sixth seed from China, finished in 6.18 seconds.\n\nMiroslaw's fellow Pole, Aleksandra Kalucka, won the bronze following her scramble up the wall against Rajiah Sallsabillah from Indonesia. Those slug-a-beds offered up 6.53 and 8.24 seconds respectively.\n\nOn Monday, during the first round of qualification, 30-year-old Miroslaw set a world record of 6.06 seconds.\n\n\"I wasn't thinking about the time,\" said Miroslaw after her rapid ascent to gold.\n\n\"The one thing on my mind was just run ... whatever happens, just run. It means a lot, because the Paris Olympics is the first time for speed climbing and also the first gold for me.\n\n\"I have my flag and I was standing on the podium, hearing my national anthem. It was just amazing.”\n\nSports climbing made its Olympic debut at the Tokyo Games in 2021 six years after its governing body, the International Federation of Sport Climbing (IFSC), suggested the idea to the International Olympic Committee, the outfit which oversees the Olympic Games.\n\nDifference\n\nIn Tokyo, two sports climbing events were contested: men's combined and women's combined - a medley by any other name. It involved speed climbing, bouldering and lead climbing.\n\nIt was an amalgamation that did not sit well with the wider sports climbing community. Nor with a future Olympic champion.\n\n\"I'm really happy with this gold medal,\" added Miroslaw.\n\n\"I was also at the Tokyo Olympics and there was only the combined event so I've been happy that since Tokyo I have been able to focus on my specialty. It's really awesome.\"\n\nInsiders at the IFSC say that the federation had to take what was on offer to establish a foothold in the Olympic firmament.\n\nIn four years in Los Angeles, it is hoped that boulder or lead climbing might have their own medal events.\n\nChange\n\nFor Paris 2024, shorn of the speedsters, the combined medal in the men's and women events will incorporate lead climbing and bouldering which will take place on Thursday, Friday and Saturday.\n\n\"For me, the speed is totally different from the boulder and lead,\" said Miroslaw.\n\n\"I never have specialised in those so for me, it was a huge challenge to prepare for Tokyo.\"\n\nFor IFSC observers and local government bosses, the fans wending their way to and from the venue on the northern tip of Paris have vindicated the move to expand the sports climbing imprint on the Olympics and the decision to regenerate the area with improved tennis courts and football pitches as well as a new multi-sport gymnasium that boasts a sports climbing wall.\n\nOlympics windfall brings prospects of happy days to Paris suburbs\n\n“The Olympic Games has been the project that has made the regeneration happen,\" said Quentin Gesell, mayor of Dugny, a town next to Le Bourget. \"And it's something to be proud of.\"\n\nThe optics of the event blazed out too. Capacity crowd, searing sunshine, Abba's Mamma Mia booming out of the weapons-grade public address system, a happy, clappy spectacular.\n\n\"Of course, we all know that speed is something that can immediately be understood by the fans,\" said Fabrizio Rossini, communications director at the IFSC.\n\n\"It's fast and it's simple. We were struggling in Tokyo a little bit because we were forcing athletes to do different disciplines combined, which was not good for the speed and was not good for the athletes.\"\n\nDaily newsletterReceive essential international news every morning Subscribe",
                "title": "Up beat: Miroslaw wins Olympic gold for Poland in speed sports climbing",
                "top_image": "https://s.rfi.fr/media/display/54b482a6-54d3-11ef-ae05-005056bfb2b6/w:1280/p:16x9/Poland%27s%20Aleksandra%20Miroslaw%20celebrating%20win%20at%20Paris%20Olympics_7%20August%202024_Fabrice%20Coffrini_AFP.jpg",
                "url": "https://www.rfi.fr/en/sports/20240807-up-beat-miroslaw-wins-olympic-gold-for-poland-in-speed-sports-climbing",
                "keywords": [
                    "wins",
                    "speed",
                    "tokyo",
                    "lead",
                    "wall",
                    "beat",
                    "poland",
                    "olympic",
                    "climbing",
                    "combined",
                    "paris",
                    "olympics",
                    "miroslaw",
                    "gold"
                ],
                "summary": "Paris Olympics 2024\"Will it be a surprise or will it be the favourite?\"\nMiroslaw had surged up the array of holds pinned into the 15-metre wall on a 5 percent incline in 6.10 seconds to claim the first Olympic speed title in women's sports climbing.\nIt means a lot, because the Paris Olympics is the first time for speed climbing and also the first gold for me.\nIt involved speed climbing, bouldering and lead climbing.\nIn four years in Los Angeles, it is hoped that boulder or lead climbing might have their own medal events."
            }
        ]
    },
    "topic": {
        "name": "Speed Climbing at Paris 2024 Olympics",
        "articles": [
            {
                "title": "Aleksandra Mirosław wins Speed Climbing's historic first gold at Paris 2024!",
                "link": "https://www.planetmountain.com/en/news/competitions/paris-2024-olympics-live-sport-climbing-day-3-mens-lead-womens-speed-finals.html",
                "source": "planetmountain.com/en/news/competitions/paris-2024-olympics-live-sport-climbing-day-3-mens-lead-womens-speed-finals",
                "date": null,
                "snippet": "13:14Poland's Aleksandra Mirosław wins this first, historic Speed Climbing Olympic medal in the Paris 2024 Olympic Games. Gold, the first historic Speed gold medal, goes to Aleksandra Mirosław. But he makes a few too many mistakes low down, he hesitates and falls low. Olympic Qualifier SeriesWOMEN'S SPEEDDesak Made Rita Kusuma...",
                "summary": "13:14Poland's Aleksandra Mirosław wins this first, historic Speed Climbing Olympic medal in the Paris 2024 Olympic Games.\nGold, the first historic Speed gold medal, goes to Aleksandra Mirosław.\nBut he makes a few too many mistakes low down, he hesitates and falls low.\nOlympic Qualifier SeriesWOMEN'S SPEEDDesak Made Rita Kusuma Dewi (INA) - 1.\nOlympic Qualifier Series"
            },
            {
                "title": "Sport climbing round-up as Olympic and world records smashed",
                "link": "https://olympics.com/en/paris-2024/live-updates/913d8ab6-88da-414c-901d-3f09504ddf27",
                "source": null,
                "date": null,
                "snippet": "Track cycling: Australia win men's team pursuit goldIt's time for the men's team pursuit final. Great Britain won this title in 2008, 2012, and 2016. It's a fast start from both teams who trade narrow leads through the first kilometre of four. It is neck and neck. Australia slowly but...",
                "summary": "Track cycling: Australia win men's team pursuit goldIt's time for the men's team pursuit final.\nGreat Britain won this title in 2008, 2012, and 2016.\nIt's a fast start from both teams who trade narrow leads through the first kilometre of four.\nIt is neck and neck.\nAustralia slowly but surely start to pull away around 2km in as the gap grows to a tenth, then two tenths."
            },
            {
                "title": "Paris Olympics 2024: Google Doodle Celebrates Sports Climbing Combined",
                "link": "https://www.jagranjosh.com/general-knowledge/google-doodle-celebrates-sports-climbing-combined-1723031462-1",
                "source": null,
                "date": "2024-08-07T11:46:20+00:00",
                "snippet": "Google's iconic doodles have a knack for capturing the essence of global events, and the 2024 Paris Olympics is no exception. The Paris Olympics further elevated its status, with a larger contingent of 68 athletes from around the world competing for medals. The Paris 2024 Olympics will build on this...",
                "summary": "Google's iconic doodles have a knack for capturing the essence of global events, and the 2024 Paris Olympics is no exception.\nThe Paris Olympics further elevated its status, with a larger contingent of 68 athletes from around the world competing for medals.\nThe Paris 2024 Olympics will build on this success, with refinements to the format and increased visibility for the athletes.\nOne significant change for Paris 2024 is the separation of Speed Climbing into its own medal event, while Bouldering and Lead Climbing will be combined into a single competition.\nThe Olympics website mentions: “The world’s best 68 men’s and women’s sport climbing athletes will compete at the Olympic Games Paris 2024, from 5-10 August."
            },
            {
                "title": "Livestream and program: Olympic semifinal lead | Men",
                "link": "https://www.lacrux.com/en/sport-climbing-olympics-paris-2024/livestream-and-program-olympia-semifinal-lead-men/",
                "source": null,
                "date": "2024-08-07T03:00:00+00:00",
                "snippet": "Today, August 7, 2024, the men's semifinals in lead climbing and the women's quarterfinals, semifinals and finals in speed are taking place in the combined format at the Olympic Games in Paris. Here you can find the live streams so you can follow today's competition day at the Olympic Games...",
                "summary": "Today, August 7, 2024, the men's semifinals in lead climbing and the women's quarterfinals, semifinals and finals in speed are taking place in the combined format at the Olympic Games in Paris.\nHere you can find the live streams so you can follow today's competition day at the Olympic Games in Paris.\nThe news about the 2024 Olympic Games in Paris is presented by Mammut and UnparallelProgram Semifinal Lead Men and Quarter-, Semifinal and Final Speed ​​Women | Sport Climbing Olympics10.00 – 12.05: Bouldering & Lead, semi-final Lead Men12.35 – 12.43: Speed, quarter-final women12.46 – 12.50: Speed, women’s semi-final12.54 – 12.59: Speed, Final WomenMammut Massone Pants:Great climbing pants The Massone Pants offer robust fabric and freedom of movement for all climbing adventures.\nSRF Livestream Semifinal Lead MenImage SRFZDF Livestream Semifinal Lead MenImage ZDFUnparallel Flagship Pro:High-performance competition climbing shoe The Flagship Pro is a competition shoe that was developed together with Boulder World Champion Tomoa Narasaki.\nSRF Livestream Quarter-, Semi-Final and Final Speed ​​WomenImage SRFZDF Livestream Quarter-, Semi-Final and Final Speed ​​WomenImage ZDFContent partner Olympic Games 2024 in ParisThe coverage of the 2024 Olympic Games in Paris is presented by Mammut and Unparallel:Mammoth is a Swiss outdoor company founded in 1862 that offers mountain sports fans all over the world high-quality products and unique brand experiences."
            }
        ],
        "formatted_articles": "Title: Aleksandra Mirosław wins Speed Climbing's historic first gold at Paris 2024!\nSnippet: 13:14Poland's Aleksandra Mirosław wins this first, historic Speed Climbing Olympic medal in the Paris 2024 Olympic Games. Gold, the first historic Speed gold medal, goes to Aleksandra Mirosław. But he makes a few too many mistakes low down, he hesitates and falls low. Olympic Qualifier SeriesWOMEN'S SPEEDDesak Made Rita Kusuma...\n----\nTitle: Sport climbing round-up as Olympic and world records smashed\nSnippet: Track cycling: Australia win men's team pursuit goldIt's time for the men's team pursuit final. Great Britain won this title in 2008, 2012, and 2016. It's a fast start from both teams who trade narrow leads through the first kilometre of four. It is neck and neck. Australia slowly but...\n----\nTitle: Paris Olympics 2024: Google Doodle Celebrates Sports Climbing Combined\nSnippet: Google's iconic doodles have a knack for capturing the essence of global events, and the 2024 Paris Olympics is no exception. The Paris Olympics further elevated its status, with a larger contingent of 68 athletes from around the world competing for medals. The Paris 2024 Olympics will build on this...\n----\nTitle: Livestream and program: Olympic semifinal lead | Men\nSnippet: Today, August 7, 2024, the men's semifinals in lead climbing and the women's quarterfinals, semifinals and finals in speed are taking place in the combined format at the Olympic Games in Paris. Here you can find the live streams so you can follow today's competition day at the Olympic Games..."
    },
    "primary_keyword": "Sport Climbing Paris 2024",
    "secondary_keywords": [
        "Sport climbing competition Paris 2024",
        "Paris 2024 Olympic Games climbing events",
        "Speed climbing Olympic records",
        "Sport climbing athletes Paris Olympics",
        "Paris 2024 climbing disciplines",
        "Sport climbing training tips",
        "Sport climbing equipment recommendations",
        "Paris 2024 climbing venues",
        "Sport climbing history at the Olympics",
        "Sport climbing techniques for beginners"
    ],
    "longtail_keywords": [
        "Sport climbing competition Paris 2024 tips for beginners",
        "Paris 2024 Olympic Games climbing events schedule and updates",
        "Speed climbing Olympic records broken at Paris 2024",
        "Sport climbing athletes to watch at Paris Olympics 2024",
        "Paris 2024 climbing disciplines explained for beginners",
        "Sport climbing training tips for Paris 2024 Olympics",
        "Sport climbing equipment recommendations for Paris 2024",
        "Paris 2024 climbing venues guide for spectators",
        "Sport climbing history at the Olympics and its significance",
        "Sport climbing techniques for beginners at Paris 2024 Olympics"
    ],
    "vectore_store": {
        "name": "speed_climbing_at_paris_2024_olympics",
        "directory": "vectorstores/speed_climbing_at_paris_2024_olympics_8b6a0dec010fb5623068bf1cf2b43973"
    },
    "article_directory": "articles/unveiling_sport_climbing_at_paris",
    "introduction": "Sport Climbing at the Paris 2024 Olympics is set to captivate audiences worldwide with its thrilling display of athleticism and skill. As this exciting event approaches, it's essential to delve into the various aspects that make sport climbing a unique and challenging sport. From exploring the different climbing disciplines to uncovering the top athletes to watch, this article will provide a comprehensive guide to all things related to Sport Climbing Paris 2024. Additionally, we will offer valuable insights into effective training tips, essential techniques for beginners, and recommended equipment to enhance your climbing experience. Get ready to be inspired by the world of sport climbing as we gear up for the Paris 2024 Olympics!",
    "conclusion": {
        "conclusion": "In conclusion, Sport Climbing at the Paris 2024 Olympics promises to be an exhilarating event showcasing a variety of climbing disciplines at top-notch venues. As athletes gear up for the competition, training tips, effective techniques, and recommended equipment play a crucial role in their preparation. Keep an eye out for the talented climbers who are set to make a mark at the upcoming Olympics, bringing their skills and determination to the forefront of this challenging sport.",
        "keypoints": [
            "Sport Climbing at Paris 2024 Olympics will feature a range of climbing disciplines highlighting the athleticism and skill of the competitors.",
            "The climbing venues at Paris 2024 will provide a fitting stage for athletes to demonstrate their prowess and compete at the highest level.",
            "Training tips for Sport Climbing are essential for athletes to hone their skills, improve performance, and prepare adequately for the challenges ahead.",
            "Effective techniques for beginners and recommended equipment are key aspects that can make a significant difference in a climber's performance and overall experience.",
            "The Paris 2024 Olympics will showcase talented climbers who have dedicated themselves to mastering the sport and will undoubtedly deliver thrilling performances for spectators worldwide."
        ]
    },
    "article_title": "Unveiling Sport Climbing at Paris 2024 Olympics: Athletes, Venues & Techniques",
    "sd_prompt": "Create an image showcasing a dynamic and intense sport climbing competition scene at the Paris 2024 Olympics, with athletes demonstrating impressive athleticism and skill on a challenging climbing route. The background should feature a stadium filled with enthusiastic spectators, capturing the excitement and energy of the event, high-resolution image, sharp focus, illustration, hyperdetailed photography",
    "article_images": [
        {
            "local_path": "articles/unveiling_sport_climbing_at_paris/images/image2.png",
            "upload_response": {
                "ID": 28,
                "URL": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png",
                "guid": "http://93simon7.files.wordpress.com/2024/08/image2.png",
                "date": "2024-08-07T19:20:22+02:00",
                "post_ID": 0,
                "author_ID": 4245249,
                "file": "image2.png",
                "mime_type": "image/png",
                "extension": "png",
                "title": "image2",
                "caption": "",
                "description": "",
                "alt": "",
                "icon": "https://s1.wp.com/wp-includes/images/media/default.png",
                "size": "529.61 KB",
                "thumbnails": {
                    "thumbnail": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=150",
                    "medium": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=300",
                    "large": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=512",
                    "newspack-article-block-landscape-large": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=512&h=512&crop=1",
                    "newspack-article-block-portrait-large": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=512&h=512&crop=1",
                    "newspack-article-block-square-large": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=512&h=512&crop=1",
                    "newspack-article-block-landscape-medium": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=512&h=512&crop=1",
                    "newspack-article-block-portrait-medium": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=512&h=512&crop=1",
                    "newspack-article-block-square-medium": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=512&h=512&crop=1",
                    "newspack-article-block-landscape-intermediate": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=512&h=450&crop=1",
                    "newspack-article-block-portrait-intermediate": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=450&h=512&crop=1",
                    "newspack-article-block-square-intermediate": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=512&h=512&crop=1",
                    "newspack-article-block-landscape-small": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=400&h=300&crop=1",
                    "newspack-article-block-portrait-small": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=300&h=400&crop=1",
                    "newspack-article-block-square-small": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=400&h=400&crop=1",
                    "newspack-article-block-landscape-tiny": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=200&h=150&crop=1",
                    "newspack-article-block-portrait-tiny": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=150&h=200&crop=1",
                    "newspack-article-block-square-tiny": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=200&h=200&crop=1",
                    "newspack-article-block-uncropped": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=512"
                },
                "height": 512,
                "width": 512,
                "exif": {
                    "aperture": "0",
                    "credit": "",
                    "camera": "",
                    "caption": "",
                    "created_timestamp": "0",
                    "copyright": "",
                    "focal_length": "0",
                    "iso": "0",
                    "shutter_speed": "0",
                    "title": "",
                    "orientation": "0",
                    "keywords": []
                },
                "meta": {
                    "links": {
                        "self": "https://public-api.wordpress.com/rest/v1.1/sites/235709504/media/28",
                        "help": "https://public-api.wordpress.com/rest/v1.1/sites/235709504/media/28/help",
                        "site": "https://public-api.wordpress.com/rest/v1.1/sites/235709504"
                    }
                }
            }
        },
        {
            "local_path": "articles/unveiling_sport_climbing_at_paris/images/image0.png",
            "upload_response": {
                "ID": 29,
                "URL": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png",
                "guid": "http://93simon7.files.wordpress.com/2024/08/image0-1.png",
                "date": "2024-08-07T19:20:25+02:00",
                "post_ID": 0,
                "author_ID": 4245249,
                "file": "image0-1.png",
                "mime_type": "image/png",
                "extension": "png",
                "title": "image0",
                "caption": "",
                "description": "",
                "alt": "",
                "icon": "https://s1.wp.com/wp-includes/images/media/default.png",
                "size": "531.30 KB",
                "thumbnails": {
                    "thumbnail": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=150",
                    "medium": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=300",
                    "large": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=512",
                    "newspack-article-block-landscape-large": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=512&h=512&crop=1",
                    "newspack-article-block-portrait-large": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=512&h=512&crop=1",
                    "newspack-article-block-square-large": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=512&h=512&crop=1",
                    "newspack-article-block-landscape-medium": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=512&h=512&crop=1",
                    "newspack-article-block-portrait-medium": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=512&h=512&crop=1",
                    "newspack-article-block-square-medium": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=512&h=512&crop=1",
                    "newspack-article-block-landscape-intermediate": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=512&h=450&crop=1",
                    "newspack-article-block-portrait-intermediate": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=450&h=512&crop=1",
                    "newspack-article-block-square-intermediate": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=512&h=512&crop=1",
                    "newspack-article-block-landscape-small": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=400&h=300&crop=1",
                    "newspack-article-block-portrait-small": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=300&h=400&crop=1",
                    "newspack-article-block-square-small": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=400&h=400&crop=1",
                    "newspack-article-block-landscape-tiny": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=200&h=150&crop=1",
                    "newspack-article-block-portrait-tiny": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=150&h=200&crop=1",
                    "newspack-article-block-square-tiny": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=200&h=200&crop=1",
                    "newspack-article-block-uncropped": "https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=512"
                },
                "height": 512,
                "width": 512,
                "exif": {
                    "aperture": "0",
                    "credit": "",
                    "camera": "",
                    "caption": "",
                    "created_timestamp": "0",
                    "copyright": "",
                    "focal_length": "0",
                    "iso": "0",
                    "shutter_speed": "0",
                    "title": "",
                    "orientation": "0",
                    "keywords": []
                },
                "meta": {
                    "links": {
                        "self": "https://public-api.wordpress.com/rest/v1.1/sites/235709504/media/29",
                        "help": "https://public-api.wordpress.com/rest/v1.1/sites/235709504/media/29/help",
                        "site": "https://public-api.wordpress.com/rest/v1.1/sites/235709504"
                    }
                }
            }
        }
    ],
    "outline": {
        "h2_titles": [
            {
                "title": "Sport Climbing at Paris 2024 Olympics",
                "content": "Sport climbing will be a thrilling event at  <a href=https://www.techradar.com/streaming/entertainment/how-to-watch-sport-climbing-at-olympics-2024-free-live-streams-and-key-dates>the Paris 2024 Olympics</a> , featuring 68 climbers competing in speed climbing and bouldering/<strong>lead combined disciplines</strong>. The Le <strong>Bourget</strong> Climbing venue, purpose-built for the Games, will showcase  <a href=https://www.forbes.com/sites/michellebruton/2024/08/02/heres-what-to-expect-from-2024-olympic-climbing/>three outdoor walls</a>  for the competitions. With an equal gender distribution across events, the Games will witness a significant increase in the number of athletes participating compared to Tokyo 2020. The competition promises a display of strength, speed, and skill, making it a must-watch event for sports enthusiasts worldwide.",
                "h3_titles": [
                    {
                        "title": "Overview of Climbing Disciplines",
                        "content": " <a href=https://www.forbes.com/sites/michellebruton/2024/08/02/heres-what-to-expect-from-2024-olympic-climbing/><strong>Sport climbing</strong></a>  at the Paris 2024 Olympics will feature three main disciplines: speed climbing, bouldering, and lead climbing.  <a href=https://www.climbing.com/competition/olympics/olympic-climbing-101-everything-you-need-to-know-about-climbing-at-the-2020-tokyo-olympics/>These disciplines</a>  will be combined into a single 'combined' discipline, similar to a climbing triathlon. Speed climbing involves racing to the top of a 15-meter <strong>wall</strong>, while bouldering focuses on scaling short routes with limited attempts. Lead climbing sees competitors ascending a taller wall with scoring based on progress. The overall winner will be determined by a <strong>combined score</strong> calculated from performances in all three disciplines.",
                        "web_search": {
                            "generated_query": "Types of climbing disciplines OR Overview of rock climbing styles",
                            "results": {
                                "organic_results": [
                                    {
                                        "link": "https://www.climbing.com/competition/olympics/olympic-climbing-101-everything-you-need-to-know-about-climbing-at-the-2020-tokyo-olympics/"
                                    },
                                    {
                                        "link": "https://www.switchbacktravel.com/info/how-to-choose-rock-climbing-shoes"
                                    },
                                    {
                                        "link": "https://olympics.com/en/news/sport-climbing-at-the-olympic-qualifier-series-everything-you-need-to-know"
                                    },
                                    {
                                        "link": "https://www.redbull.com/int-en/different-types-of-climbing-guide"
                                    },
                                    {
                                        "link": "https://www.outdoorgearlab.com/topics/climbing/best-climbing-harness"
                                    },
                                    {
                                        "link": "https://gearjunkie.com/climbing/best-climbing-shoes-womens"
                                    },
                                    {
                                        "link": "https://www.climbing.com/gear/evolution-of-climbings-holds/"
                                    },
                                    {
                                        "link": "https://styleblueprint.com/everyday/emma-hunt-climbing-to-the-olympics/"
                                    },
                                    {
                                        "link": "https://www.outdoorgearlab.com/topics/climbing/best-climbing-shoes"
                                    },
                                    {
                                        "link": "https://gearjunkie.com/climbing/best-mens-climbing-pants"
                                    }
                                ]
                            }
                        },
                        "sources": [
                            {
                                "page_content": "The Disciplines\n\nThere will be three disciplines, comparable to the different disciplines often offered in a climbing gym: speed climbing, bouldering, and lead climbing. However, what is unique about the Olympics is that all three types will be grouped together as separate (and mandatory) rounds of an all-encompassing “combined” discipline. Think about it like a climbing triathlon: multiple events brought together as a singular, sequential contest.",
                                "metadata": {
                                    "query": "Types of climbing disciplines OR Overview of rock climbing styles",
                                    "title": "Olympic Climbing 101: Everything You Need to Know About Climbing at the 2021 Tokyo Olympics",
                                    "url": "https://www.climbing.com/competition/olympics/olympic-climbing-101-everything-you-need-to-know-about-climbing-at-the-2020-tokyo-olympics/"
                                }
                            },
                            {
                                "page_content": "Speed climbing is the discipline that translates most clearly to a casual viewer. In this competition, athletes compete to climb to the top of a 15-meter (49-foot) wall as fast as possible. In seeding, athletes are ranked by fastest time, but elimination rounds feature a true head-to-head race to the top.\n\nBouldering and lead climbing are two separate competitive disciplines but have been combined into one event at the 2024 Games.\n\nForbes How To Watch Climbing At The 2024 Paris Olympics\n\nIn bouldering, athletes aim to scale short routes to top the boulder with the fewest attempts. Unlike in speed climbing, where climbers memorize the route to the top, athletes are not able to see the bouldering routes prior to competition, which tests their problem-solving skills as much as their physical strength.\n\nBouldering does not use ropes, but mats with thick padding surround the boulder wall, which is just under 15 feet tall. The wall features four to five set routes, called “problems.”",
                                "metadata": {
                                    "query": "Paris 2024 Climbing Venues locations",
                                    "title": "Here’s What To Expect From 2024 Olympic Climbing",
                                    "url": "https://www.forbes.com/sites/michellebruton/2024/08/02/heres-what-to-expect-from-2024-olympic-climbing/"
                                }
                            },
                            {
                                "page_content": "The merger is a fairly new idea, but it will not be totally foreign to the climbers at Tokyo. As a way to prepare the athletes, the International Sport Climbing Federation (IFSC)—the global governing body for competition climbing—began including a combined discipline (as its own entity) in climbing’s 2018 World Championships. Youth championships have also merged the events into a single collective discipline. And beginning in 2019, USA Climbing—the main governing body for competition climbing in the United States—started holding an annual Combined Invitational on par with its other national championships.",
                                "metadata": {
                                    "query": "Types of climbing disciplines OR Overview of rock climbing styles",
                                    "title": "Olympic Climbing 101: Everything You Need to Know About Climbing at the 2021 Tokyo Olympics",
                                    "url": "https://www.climbing.com/competition/olympics/olympic-climbing-101-everything-you-need-to-know-about-climbing-at-the-2020-tokyo-olympics/"
                                }
                            },
                            {
                                "page_content": "Lead climbing\n\nCompetitors, wearing harnesses attached to a climbing rope, move up a taller wall (15–20 meters) with a unique, new climb featuring 40–60 holds. While the goal is the top, competitors will be scored on how far they progress, with each handhold earning 1 point.\n\nScoring\n\nThe combined score is a multiplication of each competitor’s placement in the three disciplines. So if you were first in speed, third in bouldering, and fourth in lead climbing, your score would be: 1 x 3 x 4 = 12. The competitor with the lowest overall score wins gold.\n\nThe Event, In-Depth\n\nDates\n\nClimbing is scheduled to begin with the men’s qualification round and will conclude with the women’s final round . The Tokyo Olympics will be broadcast on NBC; however, at present, it is unknown when climbing might be featured on the American broadcast. Stay tuned to Climbing.com for updates to the TV schedule.\n\nThe Disciplines",
                                "metadata": {
                                    "query": "Types of climbing disciplines OR Overview of rock climbing styles",
                                    "title": "Olympic Climbing 101: Everything You Need to Know About Climbing at the 2021 Tokyo Olympics",
                                    "url": "https://www.climbing.com/competition/olympics/olympic-climbing-101-everything-you-need-to-know-about-climbing-at-the-2020-tokyo-olympics/"
                                }
                            }
                        ]
                    },
                    {
                        "title": "Paris 2024 Climbing Venues",
                        "content": "The Paris 2024 Climbing Venues are a <strong>key</strong> highlight of  <a href=https://www.planetmountain.com/en/news/competitions/first-photos-paris-2024-olympic-climbing-walls.html>the <strong>upcoming Olympic Games</strong></a> .  <a href=https://english.news.cn/20240531/e7ef23d10dc74afc8388f397795c8139/c.html>The Le Bourget Climbing venue</a> , purpose-built for the event, <strong>features four outdoor</strong> walls - three for competition and one for warm-up. These walls will be repurposed post-Games to benefit local communities. The facility showcases stunning design, as seen in photos by official <strong>IFSC</strong> photographer <strong>Jan</strong> <strong>Virt</strong>. With  <a href=https://olympics.com/en/paris-2024/venues/le-bourget-climbing-venue>five climbing walls</a>  in total, including an indoor wall for warm-up, the venue promises a lasting legacy for the Seine-Saint-Denis area, addressing a significant need for sports facilities.",
                        "web_search": {
                            "generated_query": "Paris 2024 Climbing Venues locations",
                            "results": {
                                "organic_results": [
                                    {
                                        "link": "https://www.ifsc-climbing.org/news/president-scolaris-welcomes-the-climbing-world-to-le-bourget"
                                    },
                                    {
                                        "link": "https://olympics.com/en/paris-2024/venues/le-bourget-climbing-venue"
                                    },
                                    {
                                        "link": "https://www.planetmountain.com/en/news/competitions/first-photos-paris-2024-olympic-climbing-walls.html"
                                    },
                                    {
                                        "link": "https://english.news.cn/20240531/e7ef23d10dc74afc8388f397795c8139/c.html"
                                    },
                                    {
                                        "link": "https://www.aljazeera.com/sports/2024/7/17/location-events-history-all-to-know-about-the-paris-2024-olympics-venues"
                                    },
                                    {
                                        "link": "https://www.forbes.com/sites/michellebruton/2024/08/02/heres-what-to-expect-from-2024-olympic-climbing/"
                                    },
                                    {
                                        "link": "https://news.abplive.com/technology/paris-games-2024-olympics-sport-climbing-google-doodle-schedule-teams-venue-location-standings-medal-tally-1708528"
                                    },
                                    {
                                        "link": "https://www.ifsc-climbing.org/news/first-french-climbers-take-in-beautiful-le-bourget-venue"
                                    },
                                    {
                                        "link": "https://www.cnn.com/2024/07/22/sport/paris-2024-olympic-games-venues-spt-intl/index.html"
                                    },
                                    {
                                        "link": "https://www.nbcolympics.com/news/sport-climbing-2024-paris-olympic-games"
                                    }
                                ]
                            }
                        },
                        "sources": [
                            {
                                "page_content": "The Paris 2024 Olympic Games are just over two months away and yesterday the Climbing venue was revealed and presented officially to the press at Le Bourget. The facility is being built specifically for Paris 2024 and the four outdoor walls – three for competition, one for warm-up – will be redeployed at the end of the Games, benefiting local associations and communities. It goes without saying that the walls are stunning, as can be seen from these photos taken by official IFSC photographer Jan Virt.\n\n\n\nOLYMPIC GAMES PARIS 2024\n\nThe Olympic Games Paris 2024 will take place in the French capital city from 26 July to 11 August. With a Speed event and a combined Boulder & Lead event in Paris, the total number of medal events for Sport Climbing will double from two at the Tokyo Games, to four in Paris. The Olympic Games will also see a significant increase in the number of Sport Climbing athletes participating in comparison to the Tokyo Games, from 40 athletes in Tokyo, to 68 in Paris.",
                                "metadata": {
                                    "query": "Paris 2024 Climbing Venues locations",
                                    "title": "First photos of the Paris 2024 Olympic Climbing Walls",
                                    "url": "https://www.planetmountain.com/en/news/competitions/first-photos-paris-2024-olympic-climbing-walls.html"
                                }
                            },
                            {
                                "page_content": "The inclusion of sport climbing at the Olympic Games illustrates the fresh approach that Paris 2024 would like to add to its Games: showcasing a modern sport practised in an area with a young population in order to promote maximum participation. Along with the Olympic Aquatics Centre in Saint-Denis, Le Bourget Climbing venue is the only sports facility to be built specifically for Paris 2024. Looking well beyond the Paris 2024 Games, this facility represents a response to a need and an expectation in the Seine-Saint-Denis area.\n\nFive climbing walls will be used during the Games: an indoor wall for warming up and four outdoor walls, with three for competition events (speed, bouldering and lead combined) and the last one set aside for competitors to warm up on.\n\nThe indoor facilities will provide a lasting legacy for the Games in a department that has a major shortage of sports facilities (ranked 103rd out of 105 departments).\n\nLegacy",
                                "metadata": {
                                    "query": "Paris 2024 Climbing Venues locations",
                                    "title": "Le Bourget Sport Climbing Venue",
                                    "url": "https://olympics.com/en/paris-2024/venues/le-bourget-climbing-venue"
                                }
                            },
                            {
                                "page_content": "This photo taken on May 30, 2024 shows the spectator stand which is under construction in the Le Bourget Sport Climbing Venue in Le Bourget, near Paris, France. The Le Bourget Sport Climbing Venue will host climbing events during the Paris 2024 Olympic Games. (Photo by Julien Mattia/Xinhua)\n\nThis photo taken on May 30, 2024 shows the competition venue for climbing events in Le Bourget, near Paris, France. The Le Bourget Sport Climbing Venue will host climbing events during the Paris 2024 Olympic Games. (Photo by Julien Mattia/Xinhua)\n\nThis photo taken on May 30, 2024 shows the training venue for climbing events in Le Bourget, near Paris, France. The Le Bourget Sport Climbing Venue will host climbing events during the Paris 2024 Olympic Games. (Photo by Julien Mattia/Xinhua)",
                                "metadata": {
                                    "query": "Paris 2024 Climbing Venues locations",
                                    "title": "Paris 2024 sport climbing venue nears completion",
                                    "url": "https://english.news.cn/20240531/e7ef23d10dc74afc8388f397795c8139/c.html"
                                }
                            },
                            {
                                "page_content": "This photo taken on May 30, 2024 shows the competition venue for climbing events in Le Bourget, near Paris, France. The Le Bourget Sport Climbing Venue will host climbing events during the Paris 2024 Olympic Games. (Photo by Julien Mattia/Xinhua)\n\nPARIS, May 30 (Xinhua) -- The construction of the sport climbing venue for the upcoming Paris Olympic Games in Le Bourget is nearly complete, as organizers unveiled one of the three newly-built Olympic venues to the press on Thursday.\n\nA temporary 15-meter-high outdoor wall has been erected in the new Parc des Sports du Bourget, located in the northeastern suburb of Paris, and the assembly of the temporary spectator stands is almost complete.",
                                "metadata": {
                                    "query": "Paris 2024 Climbing Venues locations",
                                    "title": "Paris 2024 sport climbing venue nears completion",
                                    "url": "https://english.news.cn/20240531/e7ef23d10dc74afc8388f397795c8139/c.html"
                                }
                            }
                        ]
                    }
                ],
                "web_search": {
                    "generated_query": "Sport Climbing Paris 2024 Olympics",
                    "results": {
                        "organic_results": [
                            {
                                "link": "https://www.planetmountain.com/en/news/competitions/paris-2024-olympics-live-sport-climbing-day-3-mens-lead-womens-speed-finals.html"
                            },
                            {
                                "link": "https://olympics.com/en/paris-2024/live-updates/913d8ab6-88da-414c-901d-3f09504ddf27"
                            },
                            {
                                "link": "https://www.lacrux.com/en/sport-climbing-olympics-paris-2024/livestream-and-program-olympia-semifinal-lead-men/"
                            },
                            {
                                "link": "https://www.techradar.com/streaming/entertainment/how-to-watch-sport-climbing-at-olympics-2024-free-live-streams-and-key-dates"
                            },
                            {
                                "link": "https://www.ifsc-climbing.org/news/miroslaw-makes-history-with-first-ever-olympic-speed-gold"
                            },
                            {
                                "link": "https://english.news.cn/20240807/72eb1057d93945438a6913a9b04b072c/c.html"
                            },
                            {
                                "link": "https://www.planetmountain.com/en/news/competitions/paris-2024-olympics-live-sport-climbing-day-2-mens-lead-womens-speed-finals.html"
                            },
                            {
                                "link": "https://www.rfi.fr/en/sports/20240807-up-beat-miroslaw-wins-olympic-gold-for-poland-in-speed-sports-climbing"
                            },
                            {
                                "link": "https://www.planetmountain.com/en/news/competitions/paris-2024-sport-climbing-athletes-olympic-games-schedule.html"
                            },
                            {
                                "link": "https://olympics.com/en/paris-2024/live-updates/cdea3a2a-a65c-473c-a1c2-936a194b2253"
                            }
                        ]
                    }
                },
                "sources": [
                    {
                        "page_content": "The Paris 2024 Olympic Games are just over two months away and yesterday the Climbing venue was revealed and presented officially to the press at Le Bourget. The facility is being built specifically for Paris 2024 and the four outdoor walls – three for competition, one for warm-up – will be redeployed at the end of the Games, benefiting local associations and communities. It goes without saying that the walls are stunning, as can be seen from these photos taken by official IFSC photographer Jan Virt.\n\n\n\nOLYMPIC GAMES PARIS 2024\n\nThe Olympic Games Paris 2024 will take place in the French capital city from 26 July to 11 August. With a Speed event and a combined Boulder & Lead event in Paris, the total number of medal events for Sport Climbing will double from two at the Tokyo Games, to four in Paris. The Olympic Games will also see a significant increase in the number of Sport Climbing athletes participating in comparison to the Tokyo Games, from 40 athletes in Tokyo, to 68 in Paris.",
                        "metadata": {
                            "query": "Paris 2024 Climbing Venues locations",
                            "title": "First photos of the Paris 2024 Olympic Climbing Walls",
                            "url": "https://www.planetmountain.com/en/news/competitions/first-photos-paris-2024-olympic-climbing-walls.html"
                        }
                    },
                    {
                        "page_content": "Gautron Lison L of France and Takeuchi Ai of Japan compete during the qualification of the women's ... [+] speed of sport climbing at the Olympic Qualifier Series Budapest in Budapest, Hungary, June 21, 2024. (Photo by Lian Yi/Xinhua via Getty Images) Xinhua News Agency via Getty Images\n\nSport climbing, which debuted as an Olympic sport at the Tokyo 2020 Games, will return to the program at Paris 2024, with the first competition scheduled for Monday, August 5.\n\nA total of 68 climbers have qualified to compete in Paris across two disciplines—speed climbing and bouldering/lead combined. Like all sports at Paris 2024, there is an equal gender distribution across events.\n\nThe Le Bourget Climbing venue, which will host the Olympic climbing events, is one of only two venues constructed specifically for the Games. Three outdoor walls will host each discipline of climbing.",
                        "metadata": {
                            "query": "Paris 2024 Climbing Venues locations",
                            "title": "Here’s What To Expect From 2024 Olympic Climbing",
                            "url": "https://www.forbes.com/sites/michellebruton/2024/08/02/heres-what-to-expect-from-2024-olympic-climbing/"
                        }
                    },
                    {
                        "page_content": "Everything you need to know about climbing at the Paris 2024 Games, including what has changed from Tokyo 2020 and which climbers to watch, is below.\n\nClimbing Disciplines Featured at the Paris Olympics\n\nUSA's Brooke Raboutou competes during the Boulder final event of the Sport Climbing Women's Boulder ... [+] and Lead competition during the Olympic Qualifier Series 2024 in Budapest, Hungary on June 23, 2024. (Photo by Attila KISBENEDEK / AFP) (Photo by ATTILA KISBENEDEK/AFP via Getty Images) AFP via Getty Images\n\nAthletes at the Paris 2024 Games will compete in two climbing disciplines—speed climbing and bouldering/lead combined. A total of 40 climbers will compete in bouldering and lead combined and 28 will compete in speed climbing.",
                        "metadata": {
                            "query": "Paris 2024 Climbing Venues locations",
                            "title": "Here’s What To Expect From 2024 Olympic Climbing",
                            "url": "https://www.forbes.com/sites/michellebruton/2024/08/02/heres-what-to-expect-from-2024-olympic-climbing/"
                        }
                    },
                    {
                        "page_content": "Watch sport climbing at Olympics 2024 – one of those sports that can really capture the imagination at the Games. There is strength, speed, and skill all on display as climbers navigate the various disciplines. Below we have all the information on how to watch sport climbing at the 2024 Paris Olympics Game from anywhere in the world with details on worldwide TV channels, broadcasters and free streams.\n\nThe sport climbing is underway at Paris 2024. We've seen both the men and women take on the Bouldering wall. Sorato Anraku leads the men's competition. The 17-year-old Japanese put in a stunning display, getting a score of 69. In the women's competition, it is Janja Garnbret who leads. The super Slovenian scored 99.6 on Tuesday morning.",
                        "metadata": {
                            "query": "Sport Climbing Paris 2024 Olympics",
                            "title": "How to watch Sport Climbing at Olympics 2024: free live streams and key dates, women's speed final",
                            "url": "https://www.techradar.com/streaming/entertainment/how-to-watch-sport-climbing-at-olympics-2024-free-live-streams-and-key-dates"
                        }
                    }
                ]
            },
            {
                "title": "Training Tips for Sport Climbing",
                "content": "To excel in  <a href=https://www.climbing.com/skills/sport-climbing/how-to-train-for-sport-climbing/>sport climbing</a> , it's crucial to dedicate time for training amidst your <strong>daily commitments</strong>. High-end sport climbers typically spend 10-20 hours weekly training indoors and outdoors. Planning your training schedule thoughtfully is key to progress. Understanding the three bioenergetic systems that produce ATP for climbing is essential. For beginners, starting with easy routes to build confidence and practicing  <a href=https://www.menshealth.com/uk/adventure/a61436815/what-is-bouldering/>proper climbing techniques</a>  are vital. Listening to feedback from experienced climbers and focusing on having <strong>fun</strong> while learning are also important aspects of training for sport climbing.",
                "h3_titles": [
                    {
                        "title": "Effective Sport Climbing Techniques for Beginners",
                        "content": "Effective sport climbing techniques for <strong>beginners include starting</strong> with easy routes to build confidence, focusing on  <a href=https://www.menshealth.com/uk/adventure/a61436815/what-is-bouldering/><strong>proper climbing techniques</strong></a>  like using legs for power and maintaining three points of contact on the <strong>wall</strong>. Paying attention to <strong>body</strong> positioning and balance is crucial for climbing efficiency. Beginners should not fear falling, as learning to fall safely is an essential skill. Listening to feedback from experienced climbers and being open to learning and improving are key to progress. Above all, having <strong>fun</strong> and enjoying the process is important for a positive climbing experience.",
                        "web_search": {
                            "generated_query": "Effective sport climbing techniques for beginners",
                            "results": {
                                "organic_results": [
                                    {
                                        "link": "https://www.redbull.com/us-en/rock-climbing-terms"
                                    },
                                    {
                                        "link": "https://www.climbing.com/gear/6-must-have-climbing-apps/"
                                    },
                                    {
                                        "link": "https://www.visitrenotahoe.com/things-to-do/outdoor-activities/rock-climbing"
                                    },
                                    {
                                        "link": "https://gearjunkie.com/climbing/best-climbing-shoes-womens"
                                    },
                                    {
                                        "link": "https://www.outdoorgearlab.com/topics/climbing/best-climbing-shoes"
                                    },
                                    {
                                        "link": "https://www.lacrux.com/en/training/Compensatory-training-is-good-if-done-correctly-tips/"
                                    },
                                    {
                                        "link": "https://www.frontiersin.org/journals/sports-and-active-living/articles/10.3389/fspor.2022.862782/full"
                                    },
                                    {
                                        "link": "https://gearjunkie.com/climbing/best-climbing-harnesses"
                                    },
                                    {
                                        "link": "https://www.climbing.com/skills/comprehensive-rock-climbing-training-guide-weeky-year-long/"
                                    },
                                    {
                                        "link": "https://www.outdoorgearlab.com/topics/climbing/best-quickdraw"
                                    }
                                ]
                            }
                        },
                        "sources": [
                            {
                                "page_content": "Beginner's Checklist For Bouldering\n\nFrom Clmbxr founder Rotimi Odukoya\n\n1. Start with easy routes to build confidence and familiarity with climbing movements.\n\n2. Practice proper climbing techniques, such as using your legs for power and maintaining three points of contact on the wall.\n\n3. Pay attention to your body positioning and balance to optimise your climbing efficiency.\n\n4. Don't be afraid to fall—learning to fall safely is an essential skill in bouldering.\n\n5. Listen to feedback from more experienced climbers and be open to learning and improving.\n\n6. Above all, have fun and enjoy the journey.",
                                "metadata": {
                                    "query": "Training tips for sport climbing techniques",
                                    "title": "Bouldering: What Is The Latest Fitness Craze, And Could It Help You To Build Strength and Muscle?",
                                    "url": "https://www.menshealth.com/uk/adventure/a61436815/what-is-bouldering/"
                                }
                            },
                            {
                                "page_content": "Sport climbing is one of those hobbies that’s mostly free and extremely accessible once you own the gear. But, figuring out what gear to initially purchase can be challenging.\n\nIf you are new to outdoor sport climbing, you probably want to start with only the essential gear — just enough to go to the sport crag and start climbing safely. You can get all the other interesting and attractive gizmos once you confirm that you are indeed comfortable, interested, and dedicated to advancing in the sport.\n\nSport Climbing Kit Essentials\n\nClimbing Shoes: Five Ten Kirigami (Men’s and Women’s), La Sportiva Tarantulace (Men’s and Women’s), SCARPA Vapor S (Men’s and Women’s)",
                                "metadata": {
                                    "query": "Recommended sport climbing equipment essentials",
                                    "title": "Sport Climbing Gear List: 12 Essentials for Beginners",
                                    "url": "https://gearjunkie.com/climbing/gear-list-sport-climbing-essentials"
                                }
                            },
                            {
                                "page_content": "The sport of rock climbing is having a moment. It's in the Paris 2024 Olympics; professional climber Alex Honnold, who starred in the documentary Free Solo, now has several climbing shows with National Geographic. Thanks to an explosion in the popularity of indoor climbing gyms, anyone can now give climbing a go. It's easy to see the attraction: You get a full-body workout, it's fun, and your brain has to solve problems too.\n\nWhether you're indoor climbing—or pulling on plastic, as traditionalists like to say—or going outside to climb on rock, you'll need some gear to get started. Indoor climbing is accessible, and you can go year-round; outdoor climbing has better views, more complex problem-solving, and occasionally the need to overcome fear and embrace teamwork. Here, you'll find a comprehensive selection of the best climbing equipment for beginners and improvers. We also asked the experts at Backcountry.com for their tips on dealing with notoriously uncomfortable climbing shoes.",
                                "metadata": {
                                    "query": "Recommended sport climbing equipment essentials",
                                    "title": "The Best Climbing Gear for Beginners",
                                    "url": "https://www.wired.com/gallery/best-climbing-gear/"
                                }
                            },
                            {
                                "page_content": "Harness\n\nClimbing shoes\n\nChalk bag\n\nBelay device\n\nRope\n\nIf you’re solo climbing or ‘bouldering’ (which refers to not using ropes), all you’ll need are climbing shoes and a chalk bag.\n\nStep-by-Step Instructions For Your First Indoor Rock Climbing Experience\n\nBeginner Climbing Tips:\n\nStart on a “slab” or less than a vertical wall to understand the basic movement of the sport before diving into a steeper wall angle. Focus on your hands and your feet. Try to relax your shoulders and keep your heels down. Hiring an instructor when getting started will help you learn rock climbing terminology such as ‘tie-in’, allowing you to understand how to properly use the gear correctly.\n\nStep-by-Step Climbing Tips",
                                "metadata": {
                                    "query": "Training tips for sport climbing techniques",
                                    "title": "The Ultimate Guide to Indoor Rock Climbing For Beginners",
                                    "url": "https://www.muscleandfitness.com/outdoor/the-ultimate-guide-to-indoor-rock-climbing-for-beginners/"
                                }
                            }
                        ]
                    },
                    {
                        "title": "Recommended Sport Climbing Equipment",
                        "content": "When it comes to  <a href=https://gearjunkie.com/climbing/gear-list-sport-climbing-essentials>sport climbing equipment</a> , having the right gear is crucial for a safe and <strong>enjoyable climbing experience</strong>. Essential items include climbing shoes like Five Ten Kirigami or La Sportiva Tarantulace, a chalk bag with chalk for better grip, a climbing harness for safety, a belay device for rope management, a climbing rope, and a helmet for head protection. Additionally, quickdraws, a climbing backpack, and  <a href=https://www.switchbacktravel.com/info/rock-climbing-checklist>approach shoes</a>  are recommended. Other useful extras to consider are climbing tape, a brush for cleaning holds, and a stick clip for clipping the first bolt. Knowing where to buy quality climbing gear is also important for getting reliable equipment.",
                        "web_search": {
                            "generated_query": "Recommended sport climbing equipment essentials",
                            "results": {
                                "organic_results": [
                                    {
                                        "link": "https://www.outdoorgearlab.com/topics/climbing/best-climbing-gear"
                                    },
                                    {
                                        "link": "https://gearjunkie.com/climbing/gear-list-sport-climbing-essentials"
                                    },
                                    {
                                        "link": "https://www.billboard.com/culture/product-recommendations/best-rock-climbing-gear-buy-online-1235633542/"
                                    },
                                    {
                                        "link": "https://www.switchbacktravel.com/info/rock-climbing-checklist"
                                    },
                                    {
                                        "link": "https://www.outdoorgearlab.com/topics/climbing/best-climbing-harness"
                                    },
                                    {
                                        "link": "https://www.timeout.com/newyork/things-to-do/best-places-to-go-rock-climbing-in-nyc"
                                    },
                                    {
                                        "link": "https://www.cnn.com/cnn-underscored/outdoors/alex-honnold-outdoor-essentials"
                                    },
                                    {
                                        "link": "https://gearjunkie.com/climbing/best-climbing-harnesses"
                                    },
                                    {
                                        "link": "https://www.redbull.com/us-en/rock-climbing-terms"
                                    },
                                    {
                                        "link": "https://www.wired.com/gallery/best-climbing-gear/"
                                    }
                                ]
                            }
                        },
                        "sources": [
                            {
                                "page_content": "Sport climbing is one of those hobbies that’s mostly free and extremely accessible once you own the gear. But, figuring out what gear to initially purchase can be challenging.\n\nIf you are new to outdoor sport climbing, you probably want to start with only the essential gear — just enough to go to the sport crag and start climbing safely. You can get all the other interesting and attractive gizmos once you confirm that you are indeed comfortable, interested, and dedicated to advancing in the sport.\n\nSport Climbing Kit Essentials\n\nClimbing Shoes: Five Ten Kirigami (Men’s and Women’s), La Sportiva Tarantulace (Men’s and Women’s), SCARPA Vapor S (Men’s and Women’s)",
                                "metadata": {
                                    "query": "Recommended sport climbing equipment essentials",
                                    "title": "Sport Climbing Gear List: 12 Essentials for Beginners",
                                    "url": "https://gearjunkie.com/climbing/gear-list-sport-climbing-essentials"
                                }
                            },
                            {
                                "page_content": "Trad Climbing Gear Sport Climbing Gear Bouldering Gear Extras ❒ Climbing Shoes ❒ Chalk Bag and Chalk ❒ Climbing Harness ❒ Belay Device ❒ Climbing Rope ❒ Climbing Helmet ❒ Quickdraws ❒ Climbing Backpack ❒ Approach Shoes ❒ Cams ❒ Nuts and Nut Tool ❒ Alpine Draws ❒ Climbing Shoes ❒ Chalk Bag and Chalk ❒ Climbing Harness ❒ Belay Device ❒ Climbing Rope & Rope Bag ❒ Climbing Helmet ❒ Quickdraws ❒ Climbing Backpack ❒ Approach Shoes ❒ Climbing Shoes ❒ Chalk Bag and Chalk ❒ Crash Pad ❒ Approach Shoes ❒ Follower Pack ❒ Personal Anchor System ❒ Anchor Supplies ❒ Climbing Tape ❒ Brush ❒ Stick Clip ❒ Belay Glasses ❒ Belay Gloves ❒ Extra Locking Carabiners ❒ Autoblock ❒ Crack Gloves ❒ Headlamp ❒ Walkie Talkies ❒ Hand Salve ❒ Topo or Guide Book ❒ Food, Water, Extra Layers\n\n\n\nRock Climbing Gear",
                                "metadata": {
                                    "query": "Recommended sport climbing equipment essentials",
                                    "title": "Rock Climbing Checklist",
                                    "url": "https://www.switchbacktravel.com/info/rock-climbing-checklist"
                                }
                            },
                            {
                                "page_content": "Climbing tape for hands and fingers\n\nBrush for cleaning holds\n\nStick clip (to clip the first bolt)\n\nBelay glasses\n\nBelay gloves\n\nExtra locking carabiners\n\nAutoblock (used when rappelling)\n\nCrack gloves (better protection than tape)\n\nHeadlamp\n\nWalkie talkies (we love Rocky Talkies for multi-pitch routes)\n\nHand salve\n\nRoute description, topo, or guide book\n\nOther standard essentials such as food, water, and extra layers\n\n\n\nWhere to Buy Climbing Gear",
                                "metadata": {
                                    "query": "Recommended sport climbing equipment essentials",
                                    "title": "Rock Climbing Checklist",
                                    "url": "https://www.switchbacktravel.com/info/rock-climbing-checklist"
                                }
                            },
                            {
                                "page_content": "Whether you spend your days climbing indoors or scaling multi-hundred-foot monoliths, it’s always helpful to know what you need. Our detailed climbing checklist below covers everything from equipment for different types of climbing (bouldering, sport, trad) to optional items and extras you won’t want to forget. For more information on each product category, many of the headings link to our detailed product round-ups, which are the result of years of testing and opinions (we spend a lot of time outside). And for all of our recommendations in one place, see our climbing gear reviews.",
                                "metadata": {
                                    "query": "Recommended sport climbing equipment essentials",
                                    "title": "Rock Climbing Checklist",
                                    "url": "https://www.switchbacktravel.com/info/rock-climbing-checklist"
                                }
                            }
                        ]
                    }
                ],
                "web_search": {
                    "generated_query": "Training tips for sport climbing techniques",
                    "results": {
                        "organic_results": [
                            {
                                "link": "https://www.climbing.com/skills/training/how-train-bouldering/"
                            },
                            {
                                "link": "https://www.menshealth.com/uk/adventure/a61436815/what-is-bouldering/"
                            },
                            {
                                "link": "https://www.climbing.com/skills/sport-climbing/how-to-train-for-sport-climbing/"
                            },
                            {
                                "link": "https://www.redbull.com/int-en/speed-climbing-all-you-need-to-know"
                            },
                            {
                                "link": "https://www.muscleandfitness.com/outdoor/the-ultimate-guide-to-indoor-rock-climbing-for-beginners/"
                            },
                            {
                                "link": "https://olympics.com/en/news/sport-climbing-training-regime-schedule-recovery-mental-strength-gym"
                            },
                            {
                                "link": "https://www.lacrux.com/en/training/Compensatory-training-is-good-if-done-correctly-tips/"
                            },
                            {
                                "link": "https://www.forbes.com/sites/wendyaltschuler/2023/09/05/a-beginners-guide-to-indoor-climbing-heres-what-you-need-to-know/"
                            },
                            {
                                "link": "https://www.climbing.com/skills/comprehensive-rock-climbing-training-guide-weeky-year-long/"
                            },
                            {
                                "link": "https://www.redbull.com/us-en/speed-climbing-all-you-need-to-know"
                            }
                        ]
                    }
                },
                "sources": [
                    {
                        "page_content": "Odukoya favours comfortable, flexible clothing that offers a full range of motion. ‘Additionally, consider investing in chalk and a chalk bag,’ he suggests. Chalk can help with sweaty palms by offering an extra level of grip. You’ll even see climbers brushing holds to improve grip, but turning up for your first session with your own brush is a bit like playing a five-a-side match in shin pads – there’s really no need at that level.\n\nShoes will be your main outlay, but even then you can get a decent pair for fifty quid if you’re tired of renting. ‘Avoid buying shoes that are eye-wateringly tight – climbing shoes should be snug, to stop your foot moving around too much, but don’t need to be painful,’ advises Gomez. ‘Try shoes made by different manufacturers, just because your friend or favourite athlete swears by one shoe, it might not be the best one for you.’\n\nHow Should I Train for Bouldering?",
                        "metadata": {
                            "query": "Training tips for sport climbing techniques",
                            "title": "Bouldering: What Is The Latest Fitness Craze, And Could It Help You To Build Strength and Muscle?",
                            "url": "https://www.menshealth.com/uk/adventure/a61436815/what-is-bouldering/"
                        }
                    },
                    {
                        "page_content": "Balancing Training Around Your Life\n\nTo improve as a sport climber, you will likely need to spend more time in the gym (or on the wall) than your bouldering counterparts. It is common for high-end sport climbers to spend a combined 10-20 hours per week training indoors and climbing outside. Finding this kind of time to commit to climbing—amidst a busy work, family, and social schedule—demands disciplined planning and execution.\n\nEnergy System Training for Sport Climbers\n\nUnder the tutelage of my father, Eric Hörst, I learned to schedule my training thoughtfully, rather than making it up on the go as many folks do. Here’s a quick overview of what my father taught me:\n\nATP (or adenosine triphosphate) is our muscles’ energy currency, and there are three bioenergetic systems that produce ATP for climbing.\n\nAnaerobic alactic: Provides instant power for brief near-maximum intensity movements up to 10 seconds.",
                        "metadata": {
                            "query": "Training tips for sport climbing techniques",
                            "title": "A Simple Guide to Sport Climbing Harder",
                            "url": "https://www.climbing.com/skills/sport-climbing/how-to-train-for-sport-climbing/"
                        }
                    },
                    {
                        "page_content": "Beginner's Checklist For Bouldering\n\nFrom Clmbxr founder Rotimi Odukoya\n\n1. Start with easy routes to build confidence and familiarity with climbing movements.\n\n2. Practice proper climbing techniques, such as using your legs for power and maintaining three points of contact on the wall.\n\n3. Pay attention to your body positioning and balance to optimise your climbing efficiency.\n\n4. Don't be afraid to fall—learning to fall safely is an essential skill in bouldering.\n\n5. Listen to feedback from more experienced climbers and be open to learning and improving.\n\n6. Above all, have fun and enjoy the journey.",
                        "metadata": {
                            "query": "Training tips for sport climbing techniques",
                            "title": "Bouldering: What Is The Latest Fitness Craze, And Could It Help You To Build Strength and Muscle?",
                            "url": "https://www.menshealth.com/uk/adventure/a61436815/what-is-bouldering/"
                        }
                    },
                    {
                        "page_content": "Harness\n\nClimbing shoes\n\nChalk bag\n\nBelay device\n\nRope\n\nIf you’re solo climbing or ‘bouldering’ (which refers to not using ropes), all you’ll need are climbing shoes and a chalk bag.\n\nStep-by-Step Instructions For Your First Indoor Rock Climbing Experience\n\nBeginner Climbing Tips:\n\nStart on a “slab” or less than a vertical wall to understand the basic movement of the sport before diving into a steeper wall angle. Focus on your hands and your feet. Try to relax your shoulders and keep your heels down. Hiring an instructor when getting started will help you learn rock climbing terminology such as ‘tie-in’, allowing you to understand how to properly use the gear correctly.\n\nStep-by-Step Climbing Tips",
                        "metadata": {
                            "query": "Training tips for sport climbing techniques",
                            "title": "The Ultimate Guide to Indoor Rock Climbing For Beginners",
                            "url": "https://www.muscleandfitness.com/outdoor/the-ultimate-guide-to-indoor-rock-climbing-for-beginners/"
                        }
                    }
                ]
            },
            {
                "title": "Athletes to Watch at Paris Olympics 2024",
                "content": "At  <a href=https://www.usatoday.com/story/sports/olympics/2024/08/07/paris-olympics-live-updates-results/74191093007/>the <strong>Paris Olympics</strong></a>  2024, keep an eye on American stars like Noah Lyles and Rai Benjamin in track events, <strong>Delaney Schnell</strong> in diving, and Katie <strong>Moon</strong> in pole-vault. Also, watch out for  <a href=https://olympics.com/en/news/paris-2024-usa-preview-watch-athletes-5-august>Daniela Moroz</a>  in sailing and the <strong>USA</strong> women's basketball team in action. With a mix of seasoned champions and rising talents, Team USA promises thrilling performances across various sports on Day 10 of the Games.",
                "web_search": {
                    "generated_query": "Athletes to Watch Paris Olympics 2024",
                    "results": {
                        "organic_results": [
                            {
                                "link": "https://www.bbc.co.uk/mediacentre/articles/2024/olympic-games-2024-paris-athletics"
                            },
                            {
                                "link": "https://www.eurosport.com/athletics/olympic-games-paris-2024/2024/cameraperson-wanders-onto-track-athletes-take-evasive-action-at-paris-2024-one-of-those-mornings_vid2209183/video.shtml"
                            },
                            {
                                "link": "https://olympics.com/en/news/paris-2024-usa-preview-watch-athletes-5-august"
                            },
                            {
                                "link": "https://www.nbcphiladelphia.com/paris-2024-summer-olympics/athletes-most-gold-total-medals-2024-olympics-team-usa/3936588/"
                            },
                            {
                                "link": "https://www.usatoday.com/story/sports/olympics/2024/08/07/paris-olympics-live-updates-results/74191093007/"
                            },
                            {
                                "link": "https://www.timeout.com/australia/news/how-and-when-to-watch-the-2024-paris-olympics-in-australia-041824"
                            },
                            {
                                "link": "https://www.euronews.com/culture/2024/08/06/paris-olympics-the-video-games-to-play-to-take-home-virtual-gold"
                            },
                            {
                                "link": "https://worldathletics.org/competitions/olympic-games/paris24/news/article/expected-highlights-athletics-paris-2024-olympics-day-4-august"
                            },
                            {
                                "link": "https://www.theguardian.com/sport/article/2024/aug/06/nbcs-high-school-french-olympics-are-a-triumph-of-shock-and-awe-streaming"
                            },
                            {
                                "link": "https://olympics.com/en/news/paris-2024-olympics-live-updates-india-august-7"
                            }
                        ]
                    }
                },
                "sources": [
                    {
                        "page_content": "Day 10 of the Games features the Olympic Games Paris 2024 debut of many American stars, while others look to conclude their trip to Paris on the podium. From athletics to sailing and even on the basketball court, Team USA will have ample opportunity to shine on Monday, 5 August.\n\nNewly minted men's 100m champion Noah Lyles and Rai Benjamin will take to the track in the men’s athletics 200 meters and 400m hurdles, respectively.\n\nDelaney Schnell will take a leap in the women's diving 10m platform preliminary.\n\nKatie Moon begins her quest for a second Olympic gold medal, beginning with women’s athletics pole-vault qualification.\n\nWith sailing’s formula kite making its Olympic debut, Daniela Moroz will look to make an early impression.\n\nThe USA women's team will take on Spain in the 3x3 basketball semifinals.\n\nRead on to discover Team USA’s highlights on Day 10 of Paris 2024.\n\nOlympic Games Paris 2024: Full schedule",
                        "metadata": {
                            "query": "Athletes to Watch Paris Olympics 2024",
                            "title": "Team USA at Paris 2024 Olympics: Preview, highlights, athletes to watch, and schedule for 5 August",
                            "url": "https://olympics.com/en/news/paris-2024-usa-preview-watch-athletes-5-august"
                        }
                    },
                    {
                        "page_content": "Paris Olympics live updates: Hampton Morris breaks medal drought; Track & field schedule\n\nShow Caption Hide Caption Caroline Marks wins surfing gold, Gabby Thomas breezes in 200m final A huge day for US women in Paris featured gold medals for Caroline Marks in surfing, Gabby Thomas in the 200m and 20-year-old Amit Elor in wrestling.\n\nThe 2024 Paris Olympics keep barreling on Wednesday with a full track and field slate as well as the men’s skateboarding park final, Round 1 of women’s golf, women’s basketball quarterfinals and artistic swimming’s team acrobatic medal event.\n\nThe Olympic track and field schedule features four finals, including the women’s pole vault and men’s 400m, and Noah Lyles running in the men’s 200m semifinal.\n\nTwenty sports in total are in action, and USA TODAY Sports will bring you live results, medal count, highlights, and more throughout the day. Follow along.\n\nPARIS — A gold medal escaped the U.S. men’s volleyball team again.",
                        "metadata": {
                            "query": "Athletes to Watch Paris Olympics 2024",
                            "title": "Paris Olympics live updates: Hampton Morris breaks medal drought; Track & field schedule",
                            "url": "https://www.usatoday.com/story/sports/olympics/2024/08/07/paris-olympics-live-updates-results/74191093007/"
                        }
                    },
                    {
                        "page_content": "Everything you need to know about climbing at the Paris 2024 Games, including what has changed from Tokyo 2020 and which climbers to watch, is below.\n\nClimbing Disciplines Featured at the Paris Olympics\n\nUSA's Brooke Raboutou competes during the Boulder final event of the Sport Climbing Women's Boulder ... [+] and Lead competition during the Olympic Qualifier Series 2024 in Budapest, Hungary on June 23, 2024. (Photo by Attila KISBENEDEK / AFP) (Photo by ATTILA KISBENEDEK/AFP via Getty Images) AFP via Getty Images\n\nAthletes at the Paris 2024 Games will compete in two climbing disciplines—speed climbing and bouldering/lead combined. A total of 40 climbers will compete in bouldering and lead combined and 28 will compete in speed climbing.",
                        "metadata": {
                            "query": "Paris 2024 Climbing Venues locations",
                            "title": "Here’s What To Expect From 2024 Olympic Climbing",
                            "url": "https://www.forbes.com/sites/michellebruton/2024/08/02/heres-what-to-expect-from-2024-olympic-climbing/"
                        }
                    },
                    {
                        "page_content": "It’s hard to believe that an Olympic year has rolled around yet again. In 2024, the world’s largest sporting event will bring together more than 10,500 athletes (5,250 women and 5,250 men) in a grand spectacle encompassing 329 medal events across 32 sports. Whether you're lucky enough to be travelling to Paris or tuning in from half way around the world, there are countless ways to get around the green and gold. Here’s everything you need to know about watching the 2024 Paris Summer Olympics.\n\nStay in the loop: sign up for our free Time Out Australia newsletter for more news, travel inspo and activity ideas, straight to your inbox.\n\nWhere are the 2024 Olympics?\n\nThe Games will be hosted in Paris, France across 41 venues, with the surfing competition taking place in Teahupo’o, Tahiti.",
                        "metadata": {
                            "query": "Athletes to Watch Paris Olympics 2024",
                            "title": "How To Watch Paris 2024 Olympics in Australia: TV Schedule, Live Stream & Schedule For Summer Games",
                            "url": "https://www.timeout.com/australia/news/how-and-when-to-watch-the-2024-paris-olympics-in-australia-041824"
                        }
                    }
                ]
            }
        ]
    },
    "full_article": "<!-- wp:image {\"id\":None,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} -->\n<figure class=\"wp-block-image size-large\"><img src=\"https://93simon7.wordpress.com/wp-content/uploads/2024/08/image2.png?w=None\" alt=\"\" class=\"wp-image-None\" /></figure>\n<!-- /wp:image -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Key points</h2>\n<!-- /wp:heading -->\n<!-- wp:list -->\n<ul class=\"wp-block-list\">\n<!-- wp:list-item -->\n<li>Sport Climbing at Paris 2024 Olympics will feature a range of climbing disciplines highlighting the athleticism and skill of the competitors.</li>\n<!-- /wp:list-item -->\n<!-- wp:list-item -->\n<li>The climbing venues at Paris 2024 will provide a fitting stage for athletes to demonstrate their prowess and compete at the highest level.</li>\n<!-- /wp:list-item -->\n<!-- wp:list-item -->\n<li>Training tips for Sport Climbing are essential for athletes to hone their skills, improve performance, and prepare adequately for the challenges ahead.</li>\n<!-- /wp:list-item -->\n<!-- wp:list-item -->\n<li>Effective techniques for beginners and recommended equipment are key aspects that can make a significant difference in a climber's performance and overall experience.</li>\n<!-- /wp:list-item -->\n<!-- wp:list-item -->\n<li>The Paris 2024 Olympics will showcase talented climbers who have dedicated themselves to mastering the sport and will undoubtedly deliver thrilling performances for spectators worldwide.</li>\n<!-- /wp:list-item -->\n</ul>\n<!-- /wp:list -->\n\n\n\n<!-- wp:paragraph -->\n<p>Sport Climbing at the Paris 2024 Olympics is set to captivate audiences worldwide with its thrilling display of athleticism and skill. As this exciting event approaches, it's essential to delve into the various aspects that make sport climbing a unique and challenging sport. From exploring the different climbing disciplines to uncovering the top athletes to watch, this article will provide a comprehensive guide to all things related to Sport Climbing Paris 2024. Additionally, we will offer valuable insights into effective training tips, essential techniques for beginners, and recommended equipment to enhance your climbing experience. Get ready to be inspired by the world of sport climbing as we gear up for the Paris 2024 Olympics!</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Sport Climbing at Paris 2024 Olympics</h2>\n<!-- /wp:heading -->\n<!-- wp:paragraph -->\n<p>Sport climbing will be a thrilling event at <a href=https://www.techradar.com/streaming/entertainment/how-to-watch-sport-climbing-at-olympics-2024-free-live-streams-and-key-dates>the Paris 2024 Olympics</a> , featuring 68 climbers competing in speed climbing and bouldering/<strong>lead combined disciplines</strong>. The Le <strong>Bourget</strong> Climbing venue, purpose-built for the Games, will showcase <a href=https://www.forbes.com/sites/michellebruton/2024/08/02/heres-what-to-expect-from-2024-olympic-climbing/>three outdoor walls</a> for the competitions. With an equal gender distribution across events, the Games will witness a significant increase in the number of athletes participating compared to Tokyo 2020. The competition promises a display of strength, speed, and skill, making it a must-watch event for sports enthusiasts worldwide.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3 class=\"wp-block-heading\">Overview of Climbing Disciplines</h2>\n<!-- /wp:heading -->\n<!-- wp:paragraph -->\n<p> <a href=https://www.forbes.com/sites/michellebruton/2024/08/02/heres-what-to-expect-from-2024-olympic-climbing/><strong>Sport climbing</strong></a> at the Paris 2024 Olympics will feature three main disciplines: speed climbing, bouldering, and lead climbing. <a href=https://www.climbing.com/competition/olympics/olympic-climbing-101-everything-you-need-to-know-about-climbing-at-the-2020-tokyo-olympics/>These disciplines</a> will be combined into a single 'combined' discipline, similar to a climbing triathlon. Speed climbing involves racing to the top of a 15-meter <strong>wall</strong>, while bouldering focuses on scaling short routes with limited attempts. Lead climbing sees competitors ascending a taller wall with scoring based on progress. The overall winner will be determined by a <strong>combined score</strong> calculated from performances in all three disciplines.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3 class=\"wp-block-heading\">Paris 2024 Climbing Venues</h2>\n<!-- /wp:heading -->\n<!-- wp:paragraph -->\n<p>The Paris 2024 Climbing Venues are a <strong>key</strong> highlight of <a href=https://www.planetmountain.com/en/news/competitions/first-photos-paris-2024-olympic-climbing-walls.html>the <strong>upcoming Olympic Games</strong></a> . <a href=https://english.news.cn/20240531/e7ef23d10dc74afc8388f397795c8139/c.html>The Le Bourget Climbing venue</a> , purpose-built for the event, <strong>features four outdoor</strong> walls - three for competition and one for warm-up. These walls will be repurposed post-Games to benefit local communities. The facility showcases stunning design, as seen in photos by official <strong>IFSC</strong> photographer <strong>Jan</strong> <strong>Virt</strong>. With <a href=https://olympics.com/en/paris-2024/venues/le-bourget-climbing-venue>five climbing walls</a> in total, including an indoor wall for warm-up, the venue promises a lasting legacy for the Seine-Saint-Denis area, addressing a significant need for sports facilities.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Training Tips for Sport Climbing</h2>\n<!-- /wp:heading -->\n<!-- wp:paragraph -->\n<p>To excel in <a href=https://www.climbing.com/skills/sport-climbing/how-to-train-for-sport-climbing/>sport climbing</a> , it's crucial to dedicate time for training amidst your <strong>daily commitments</strong>. High-end sport climbers typically spend 10-20 hours weekly training indoors and outdoors. Planning your training schedule thoughtfully is key to progress. Understanding the three bioenergetic systems that produce ATP for climbing is essential. For beginners, starting with easy routes to build confidence and practicing <a href=https://www.menshealth.com/uk/adventure/a61436815/what-is-bouldering/>proper climbing techniques</a> are vital. Listening to feedback from experienced climbers and focusing on having <strong>fun</strong> while learning are also important aspects of training for sport climbing.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3 class=\"wp-block-heading\">Effective Sport Climbing Techniques for Beginners</h2>\n<!-- /wp:heading -->\n<!-- wp:paragraph -->\n<p>Effective sport climbing techniques for <strong>beginners include starting</strong> with easy routes to build confidence, focusing on <a href=https://www.menshealth.com/uk/adventure/a61436815/what-is-bouldering/><strong>proper climbing techniques</strong></a> like using legs for power and maintaining three points of contact on the <strong>wall</strong>. Paying attention to <strong>body</strong> positioning and balance is crucial for climbing efficiency. Beginners should not fear falling, as learning to fall safely is an essential skill. Listening to feedback from experienced climbers and being open to learning and improving are key to progress. Above all, having <strong>fun</strong> and enjoying the process is important for a positive climbing experience.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3 class=\"wp-block-heading\">Recommended Sport Climbing Equipment</h2>\n<!-- /wp:heading -->\n<!-- wp:paragraph -->\n<p>When it comes to <a href=https://gearjunkie.com/climbing/gear-list-sport-climbing-essentials>sport climbing equipment</a> , having the right gear is crucial for a safe and <strong>enjoyable climbing experience</strong>. Essential items include climbing shoes like Five Ten Kirigami or La Sportiva Tarantulace, a chalk bag with chalk for better grip, a climbing harness for safety, a belay device for rope management, a climbing rope, and a helmet for head protection. Additionally, quickdraws, a climbing backpack, and <a href=https://www.switchbacktravel.com/info/rock-climbing-checklist>approach shoes</a> are recommended. Other useful extras to consider are climbing tape, a brush for cleaning holds, and a stick clip for clipping the first bolt. Knowing where to buy quality climbing gear is also important for getting reliable equipment.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\"id\":None,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} -->\n<figure class=\"wp-block-image size-large\"><img src=\"https://93simon7.wordpress.com/wp-content/uploads/2024/08/image0-1.png?w=None\" alt=\"\" class=\"wp-image-None\" /></figure>\n<!-- /wp:image -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Athletes to Watch at Paris Olympics 2024</h2>\n<!-- /wp:heading -->\n<!-- wp:paragraph -->\n<p>At <a href=https://www.usatoday.com/story/sports/olympics/2024/08/07/paris-olympics-live-updates-results/74191093007/>the <strong>Paris Olympics</strong></a> 2024, keep an eye on American stars like Noah Lyles and Rai Benjamin in track events, <strong>Delaney Schnell</strong> in diving, and Katie <strong>Moon</strong> in pole-vault. Also, watch out for <a href=https://olympics.com/en/news/paris-2024-usa-preview-watch-athletes-5-august>Daniela Moroz</a> in sailing and the <strong>USA</strong> women's basketball team in action. With a mix of seasoned champions and rising talents, Team USA promises thrilling performances across various sports on Day 10 of the Games.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Conclusion</h2>\n<!-- /wp:heading -->\n<!-- wp:paragraph -->\n<p>In conclusion, Sport Climbing at the Paris 2024 Olympics promises to be an exhilarating event showcasing a variety of climbing disciplines at top-notch venues. As athletes gear up for the competition, training tips, effective techniques, and recommended equipment play a crucial role in their preparation. Keep an eye out for the talented climbers who are set to make a mark at the upcoming Olympics, bringing their skills and determination to the forefront of this challenging sport.</p>\n<!-- /wp:paragraph -->"
}